43) /var/www/html/src/Account/Application/Password/ResetPasswordService.php:29    [M] PublicVisibility

--- Original
+++ New
@@ @@
      * @throws CannotSendEmailException
      * @throws TokenGeneratingFailedException
      */
-    public function processResetPasswordSendEmail(string $email): void
+    protected function processResetPasswordSendEmail(string $email): void
     {
         $user = $this->userRepository->getByEmail($email);
         if (null !== $user) {

45) /var/www/html/src/Account/Application/Password/ResetPasswordService.php:36    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $user = $this->userRepository->getByEmail($email);
         if (null !== $user) {
             $passwordToken = $this->passwordTokenService->generateTokenForResetPassword($user);
-            $this->accountMailerService->sendResetPasswordEmail($email, $passwordToken);
+            
         }
     }
     /**

51) /var/www/html/src/Account/Application/Password/ResetPasswordService.php:58    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             throw new TokenNotFoundException();
         }
         try {
-            $this->passwordManager->updatePassword($user, $password);
+            
         } catch (\Throwable $exception) {
             $this->logger->error('An error occurred while resetting password.', ['exception' => $exception, 'email' => $email, 'class' => __CLASS__]);
             throw new ResetPasswordException();

55) /var/www/html/src/Account/Application/Password/TokenService.php:22    [M] PublicVisibility

--- Original
+++ New
@@ @@
     /**
      * @throws TokenGeneratingFailedException
      */
-    public function generateTokenForResetPassword(User $user): PasswordToken
+    protected function generateTokenForResetPassword(User $user): PasswordToken
     {
         try {
             $passwordToken = PasswordToken::generateForOneDay($user);

60) /var/www/html/src/Account/Application/Password/TokenService.php:45    [M] PublicVisibility

--- Original
+++ New
@@ @@
     /**
      * @throws TokenGeneratingFailedException
      */
-    public function generateTokenForVerifyAccount(User $user): PasswordToken
+    protected function generateTokenForVerifyAccount(User $user): PasswordToken
     {
         try {
             $passwordToken = PasswordToken::generateForMonth($user);

61) /var/www/html/src/Account/Application/Password/TokenService.php:49    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         try {
             $passwordToken = PasswordToken::generateForMonth($user);
-            $this->passwordTokenRepository->save($passwordToken);
+            
             return $passwordToken;
         } catch (\Throwable $exception) {
             $this->logger->error('An error occurred while generating password token.', ['exception' => $exception, 'user' => $user, 'class' => __CLASS__]);

65) /var/www/html/src/Account/Application/Password/UpdatePasswordService.php:17    [M] PublicVisibility

--- Original
+++ New
@@ @@
     public function __construct(private readonly UserRepositoryInterface $userRepository, private readonly UserPasswordHasherInterface $passwordHasher)
     {
     }
-    public function updatePassword(User $user, string $password): ?string
+    protected function updatePassword(User $user, string $password): ?string
     {
         $passwordHashed = $this->passwordHasher->hashPassword($user, $password);
         $this->userRepository->upgradePassword($user, $passwordHashed);

190) /var/www/html/src/Account/Ui/Authentication/AccountAuthenticator.php:54    [M] FalseValue

--- Original
+++ New
@@ @@
     }
     public function onAuthenticationSuccess(Request $request, TokenInterface $token, string $firewallName): ?Response
     {
-        if (false === $this->accountAuthenticator->isVerified($request)) {
+        if (true === $this->accountAuthenticator->isVerified($request)) {
             return new RedirectResponse($this->accountAuthenticator->getLoginUrl());
         }
         if ($targetPath = $this->getTargetPath($request->getSession(), $firewallName)) {

191) /var/www/html/src/Account/Ui/Authentication/AccountAuthenticator.php:54    [M] Identical

--- Original
+++ New
@@ @@
     }
     public function onAuthenticationSuccess(Request $request, TokenInterface $token, string $firewallName): ?Response
     {
-        if (false === $this->accountAuthenticator->isVerified($request)) {
+        if (false !== $this->accountAuthenticator->isVerified($request)) {
             return new RedirectResponse($this->accountAuthenticator->getLoginUrl());
         }
         if ($targetPath = $this->getTargetPath($request->getSession(), $firewallName)) {

192) /var/www/html/src/Account/Ui/Authentication/AccountAuthenticator.php:55    [M] NewObject

--- Original
+++ New
@@ @@
     public function onAuthenticationSuccess(Request $request, TokenInterface $token, string $firewallName): ?Response
     {
         if (false === $this->accountAuthenticator->isVerified($request)) {
-            return new RedirectResponse($this->accountAuthenticator->getLoginUrl());
+            new RedirectResponse($this->accountAuthenticator->getLoginUrl());
+            return null;
         }
         if ($targetPath = $this->getTargetPath($request->getSession(), $firewallName)) {
             return new RedirectResponse($targetPath);

195) /var/www/html/src/Account/Ui/Authentication/ForgotPassword/ForgotPasswordController.php:46    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
                 $this->flasher->success('dashboard.authentication.resetPassword.email.sent.description', 'dashboard.authentication.resetPassword.email.sent.title');
                 return $this->redirectToRoute('app_login');
             } catch (CannotSendEmailException $exception) {
-                $this->flasher->error($exception->getMessage(), 'dashboard.authentication.resetPassword.email.error.cannotSendEmail.title');
+                
             } catch (TokenGeneratingFailedException $exception) {
                 $this->flasher->error($exception->getMessage(), 'dashboard.authentication.resetPassword.email.error.tokenGenerating.title');
             } catch (EmailRequiredException $exception) {

196) /var/www/html/src/Account/Ui/Authentication/Login/LoginController.php:14    [M] PublicVisibility

--- Original
+++ New
@@ @@
 class LoginController extends AbstractBaseController
 {
     #[Route(path: '/dashboard/login', name: 'app_login')]
-    public function login(AuthenticationUtils $authenticationUtils, Flasher $flasher): Response
+    protected function login(AuthenticationUtils $authenticationUtils, Flasher $flasher): Response
     {
         $user = $this->getUser();
         $error = $authenticationUtils->getLastAuthenticationError();

197) /var/www/html/src/Account/Ui/Authentication/Login/LoginController.php:20    [M] Identical

--- Original
+++ New
@@ @@
     {
         $user = $this->getUser();
         $error = $authenticationUtils->getLastAuthenticationError();
-        if (null === $error && $user && false === $user->isVerified()) {
+        if (null !== $error && $user && false === $user->isVerified()) {
             $flasher->error('dashboard.authentication.login.verifyEmail');
         }
         if ($user && $user->isAdmin() && $user->isVerified()) {

198) /var/www/html/src/Account/Ui/Authentication/Login/LoginController.php:20    [M] LogicalAnd

--- Original
+++ New
@@ @@
     {
         $user = $this->getUser();
         $error = $authenticationUtils->getLastAuthenticationError();
-        if (null === $error && $user && false === $user->isVerified()) {
+        if ((null === $error || $user) && false === $user->isVerified()) {
             $flasher->error('dashboard.authentication.login.verifyEmail');
         }
         if ($user && $user->isAdmin() && $user->isVerified()) {

199) /var/www/html/src/Account/Ui/Authentication/Login/LoginController.php:20    [M] FalseValue

--- Original
+++ New
@@ @@
     {
         $user = $this->getUser();
         $error = $authenticationUtils->getLastAuthenticationError();
-        if (null === $error && $user && false === $user->isVerified()) {
+        if (null === $error && $user && true === $user->isVerified()) {
             $flasher->error('dashboard.authentication.login.verifyEmail');
         }
         if ($user && $user->isAdmin() && $user->isVerified()) {

200) /var/www/html/src/Account/Ui/Authentication/Login/LoginController.php:20    [M] Identical

--- Original
+++ New
@@ @@
     {
         $user = $this->getUser();
         $error = $authenticationUtils->getLastAuthenticationError();
-        if (null === $error && $user && false === $user->isVerified()) {
+        if (null === $error && $user && false !== $user->isVerified()) {
             $flasher->error('dashboard.authentication.login.verifyEmail');
         }
         if ($user && $user->isAdmin() && $user->isVerified()) {

201) /var/www/html/src/Account/Ui/Authentication/Login/LoginController.php:20    [M] LogicalAnd

--- Original
+++ New
@@ @@
     {
         $user = $this->getUser();
         $error = $authenticationUtils->getLastAuthenticationError();
-        if (null === $error && $user && false === $user->isVerified()) {
+        if (null === $error && $user || false === $user->isVerified()) {
             $flasher->error('dashboard.authentication.login.verifyEmail');
         }
         if ($user && $user->isAdmin() && $user->isVerified()) {

202) /var/www/html/src/Account/Ui/Authentication/Login/LoginController.php:20    [M] LogicalAndAllSubExprNegation

--- Original
+++ New
@@ @@
     {
         $user = $this->getUser();
         $error = $authenticationUtils->getLastAuthenticationError();
-        if (null === $error && $user && false === $user->isVerified()) {
+        if (!(null === $error) && !$user && false === $user->isVerified()) {
             $flasher->error('dashboard.authentication.login.verifyEmail');
         }
         if ($user && $user->isAdmin() && $user->isVerified()) {

203) /var/www/html/src/Account/Ui/Authentication/Login/LoginController.php:20    [M] LogicalAndNegation

--- Original
+++ New
@@ @@
     {
         $user = $this->getUser();
         $error = $authenticationUtils->getLastAuthenticationError();
-        if (null === $error && $user && false === $user->isVerified()) {
+        if (!(null === $error && $user && false === $user->isVerified())) {
             $flasher->error('dashboard.authentication.login.verifyEmail');
         }
         if ($user && $user->isAdmin() && $user->isVerified()) {

204) /var/www/html/src/Account/Ui/Authentication/Login/LoginController.php:20    [M] LogicalAndSingleSubExprNegation

--- Original
+++ New
@@ @@
     {
         $user = $this->getUser();
         $error = $authenticationUtils->getLastAuthenticationError();
-        if (null === $error && $user && false === $user->isVerified()) {
+        if (null === $error && !$user && false === $user->isVerified()) {
             $flasher->error('dashboard.authentication.login.verifyEmail');
         }
         if ($user && $user->isAdmin() && $user->isVerified()) {

205) /var/www/html/src/Account/Ui/Authentication/Login/LoginController.php:21    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $user = $this->getUser();
         $error = $authenticationUtils->getLastAuthenticationError();
         if (null === $error && $user && false === $user->isVerified()) {
-            $flasher->error('dashboard.authentication.login.verifyEmail');
+            
         }
         if ($user && $user->isAdmin() && $user->isVerified()) {
             return $this->redirectToRoute(AccountAuthenticatorService::DASHBOARD_ROUTE);

213) /var/www/html/src/Account/Ui/Authentication/Login/LoginController.php:34    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         }
         $lastUsername = $authenticationUtils->getLastUsername();
         $form = $this->createForm(LoginFormType::class);
-        return $this->render('dashboard/authentication/login/login.html.twig', ['last_username' => $lastUsername, 'error' => $error, 'loginForm' => $form->createView()]);
+        return $this->render('dashboard/authentication/login/login.html.twig', ['error' => $error, 'loginForm' => $form->createView()]);
     }
     #[Route(path: '/logout', name: 'app_logout')]
     public function logout(): never

214) /var/www/html/src/Account/Ui/Authentication/Login/LoginController.php:37    [M] ArrayItem

--- Original
+++ New
@@ @@
         }
         $lastUsername = $authenticationUtils->getLastUsername();
         $form = $this->createForm(LoginFormType::class);
-        return $this->render('dashboard/authentication/login/login.html.twig', ['last_username' => $lastUsername, 'error' => $error, 'loginForm' => $form->createView()]);
+        return $this->render('dashboard/authentication/login/login.html.twig', ['last_username' => $lastUsername, 'error' => $error, 'loginForm' > $form->createView()]);
     }
     #[Route(path: '/logout', name: 'app_logout')]
     public function logout(): never

217) /var/www/html/src/Account/Ui/Authentication/Registration/RegistrationController.php:25    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
     }
     #[Route('/dashboard/register', name: 'app_register')]
-    public function register(Request $request): ?Response
+    protected function register(Request $request): ?Response
     {
         $form = $this->createForm(RegistrationFormType::class);
         $form->handleRequest($request);

227) /var/www/html/src/Account/Ui/Authentication/Registration/RegistrationController.php:36    [M] Identical

--- Original
+++ New
@@ @@
             try {
                 $email = $form->get('email')->getData();
                 $password = $form->get('password')->getData();
-                if (null === $email || false === is_string($email)) {
+                if (null !== $email || false === is_string($email)) {
                     throw new EmailRequiredException();
                 }
                 if (null === $password || false === is_string($password)) {

228) /var/www/html/src/Account/Ui/Authentication/Registration/RegistrationController.php:36    [M] FalseValue

--- Original
+++ New
@@ @@
             try {
                 $email = $form->get('email')->getData();
                 $password = $form->get('password')->getData();
-                if (null === $email || false === is_string($email)) {
+                if (null === $email || true === is_string($email)) {
                     throw new EmailRequiredException();
                 }
                 if (null === $password || false === is_string($password)) {

229) /var/www/html/src/Account/Ui/Authentication/Registration/RegistrationController.php:36    [M] Identical

--- Original
+++ New
@@ @@
             try {
                 $email = $form->get('email')->getData();
                 $password = $form->get('password')->getData();
-                if (null === $email || false === is_string($email)) {
+                if (null === $email || false !== is_string($email)) {
                     throw new EmailRequiredException();
                 }
                 if (null === $password || false === is_string($password)) {

230) /var/www/html/src/Account/Ui/Authentication/Registration/RegistrationController.php:36    [M] LogicalOr

--- Original
+++ New
@@ @@
             try {
                 $email = $form->get('email')->getData();
                 $password = $form->get('password')->getData();
-                if (null === $email || false === is_string($email)) {
+                if (null === $email && false === is_string($email)) {
                     throw new EmailRequiredException();
                 }
                 if (null === $password || false === is_string($password)) {

231) /var/www/html/src/Account/Ui/Authentication/Registration/RegistrationController.php:36    [M] LogicalOrAllSubExprNegation

--- Original
+++ New
@@ @@
             try {
                 $email = $form->get('email')->getData();
                 $password = $form->get('password')->getData();
-                if (null === $email || false === is_string($email)) {
+                if (!(null === $email) || false === is_string($email)) {
                     throw new EmailRequiredException();
                 }
                 if (null === $password || false === is_string($password)) {

232) /var/www/html/src/Account/Ui/Authentication/Registration/RegistrationController.php:36    [M] LogicalOrNegation

--- Original
+++ New
@@ @@
             try {
                 $email = $form->get('email')->getData();
                 $password = $form->get('password')->getData();
-                if (null === $email || false === is_string($email)) {
+                if (!(null === $email || false === is_string($email))) {
                     throw new EmailRequiredException();
                 }
                 if (null === $password || false === is_string($password)) {

233) /var/www/html/src/Account/Ui/Authentication/Registration/RegistrationController.php:37    [M] Throw_

--- Original
+++ New
@@ @@
                 $email = $form->get('email')->getData();
                 $password = $form->get('password')->getData();
                 if (null === $email || false === is_string($email)) {
-                    throw new EmailRequiredException();
+                    new EmailRequiredException();
                 }
                 if (null === $password || false === is_string($password)) {
                     throw new PasswordRequiredException();

234) /var/www/html/src/Account/Ui/Authentication/Registration/RegistrationController.php:40    [M] Identical

--- Original
+++ New
@@ @@
                 if (null === $email || false === is_string($email)) {
                     throw new EmailRequiredException();
                 }
-                if (null === $password || false === is_string($password)) {
+                if (null !== $password || false === is_string($password)) {
                     throw new PasswordRequiredException();
                 }
                 $this->createUserService->createUser($email, $password);

235) /var/www/html/src/Account/Ui/Authentication/Registration/RegistrationController.php:40    [M] FalseValue

--- Original
+++ New
@@ @@
                 if (null === $email || false === is_string($email)) {
                     throw new EmailRequiredException();
                 }
-                if (null === $password || false === is_string($password)) {
+                if (null === $password || true === is_string($password)) {
                     throw new PasswordRequiredException();
                 }
                 $this->createUserService->createUser($email, $password);

236) /var/www/html/src/Account/Ui/Authentication/Registration/RegistrationController.php:40    [M] Identical

--- Original
+++ New
@@ @@
                 if (null === $email || false === is_string($email)) {
                     throw new EmailRequiredException();
                 }
-                if (null === $password || false === is_string($password)) {
+                if (null === $password || false !== is_string($password)) {
                     throw new PasswordRequiredException();
                 }
                 $this->createUserService->createUser($email, $password);

237) /var/www/html/src/Account/Ui/Authentication/Registration/RegistrationController.php:40    [M] LogicalOr

--- Original
+++ New
@@ @@
                 if (null === $email || false === is_string($email)) {
                     throw new EmailRequiredException();
                 }
-                if (null === $password || false === is_string($password)) {
+                if (null === $password && false === is_string($password)) {
                     throw new PasswordRequiredException();
                 }
                 $this->createUserService->createUser($email, $password);

238) /var/www/html/src/Account/Ui/Authentication/Registration/RegistrationController.php:40    [M] LogicalOrAllSubExprNegation

--- Original
+++ New
@@ @@
                 if (null === $email || false === is_string($email)) {
                     throw new EmailRequiredException();
                 }
-                if (null === $password || false === is_string($password)) {
+                if (!(null === $password) || false === is_string($password)) {
                     throw new PasswordRequiredException();
                 }
                 $this->createUserService->createUser($email, $password);

239) /var/www/html/src/Account/Ui/Authentication/Registration/RegistrationController.php:40    [M] LogicalOrNegation

--- Original
+++ New
@@ @@
                 if (null === $email || false === is_string($email)) {
                     throw new EmailRequiredException();
                 }
-                if (null === $password || false === is_string($password)) {
+                if (!(null === $password || false === is_string($password))) {
                     throw new PasswordRequiredException();
                 }
                 $this->createUserService->createUser($email, $password);

240) /var/www/html/src/Account/Ui/Authentication/Registration/RegistrationController.php:41    [M] Throw_

--- Original
+++ New
@@ @@
                     throw new EmailRequiredException();
                 }
                 if (null === $password || false === is_string($password)) {
-                    throw new PasswordRequiredException();
+                    new PasswordRequiredException();
                 }
                 $this->createUserService->createUser($email, $password);
                 $this->flasher->success('dashboard.authentication.register.success.description', 'dashboard.authentication.register.success.title');

241) /var/www/html/src/Account/Ui/Authentication/Registration/RegistrationController.php:44    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
                 if (null === $password || false === is_string($password)) {
                     throw new PasswordRequiredException();
                 }
-                $this->createUserService->createUser($email, $password);
+                
                 $this->flasher->success('dashboard.authentication.register.success.description', 'dashboard.authentication.register.success.title');
                 return $this->redirectToRoute('app_login');
             } catch (EmailRequiredException $exception) {

242) /var/www/html/src/Account/Ui/Authentication/Registration/RegistrationController.php:48    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
                     throw new PasswordRequiredException();
                 }
                 $this->createUserService->createUser($email, $password);
-                $this->flasher->success('dashboard.authentication.register.success.description', 'dashboard.authentication.register.success.title');
+                
                 return $this->redirectToRoute('app_login');
             } catch (EmailRequiredException $exception) {
                 $this->flasher->error($exception->getMessage(), 'dashboard.authentication.register.error.emailRequired.title');

243) /var/www/html/src/Account/Ui/Authentication/Registration/RegistrationController.php:55    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
                 $this->flasher->success('dashboard.authentication.register.success.description', 'dashboard.authentication.register.success.title');
                 return $this->redirectToRoute('app_login');
             } catch (EmailRequiredException $exception) {
-                $this->flasher->error($exception->getMessage(), 'dashboard.authentication.register.error.emailRequired.title');
+                
             } catch (PasswordRequiredException $exception) {
                 $this->flasher->error($exception->getMessage(), 'dashboard.authentication.register.error.passwordRequired.title');
             } catch (\Throwable) {

244) /var/www/html/src/Account/Ui/Authentication/Registration/RegistrationController.php:60    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             } catch (EmailRequiredException $exception) {
                 $this->flasher->error($exception->getMessage(), 'dashboard.authentication.register.error.emailRequired.title');
             } catch (PasswordRequiredException $exception) {
-                $this->flasher->error($exception->getMessage(), 'dashboard.authentication.register.error.passwordRequired.title');
+                
             } catch (\Throwable) {
                 $this->flasher->error('dashboard.authentication.register.error.description', 'dashboard.authentication.register.error.title');
                 return $this->redirectToRoute('app_register');

245) /var/www/html/src/Account/Ui/Authentication/Registration/RegistrationController.php:65    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             } catch (PasswordRequiredException $exception) {
                 $this->flasher->error($exception->getMessage(), 'dashboard.authentication.register.error.passwordRequired.title');
             } catch (\Throwable) {
-                $this->flasher->error('dashboard.authentication.register.error.description', 'dashboard.authentication.register.error.title');
+                
                 return $this->redirectToRoute('app_register');
             }
         }

246) /var/www/html/src/Account/Ui/Authentication/Registration/RegistrationController.php:73    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
                 return $this->redirectToRoute('app_register');
             }
         }
-        return $this->render('dashboard/authentication/registration/register.html.twig', ['registrationForm' => $form]);
+        return $this->render('dashboard/authentication/registration/register.html.twig', []);
     }
     #[Route('/dashboard/register/confirm', name: 'app_register_confirm')]
     public function confirmRegistration(Request $request, Security $security): null|Response

247) /var/www/html/src/Account/Ui/Authentication/Registration/RegistrationController.php:78    [M] PublicVisibility

--- Original
+++ New
@@ @@
         return $this->render('dashboard/authentication/registration/register.html.twig', ['registrationForm' => $form]);
     }
     #[Route('/dashboard/register/confirm', name: 'app_register_confirm')]
-    public function confirmRegistration(Request $request, Security $security): null|Response
+    protected function confirmRegistration(Request $request, Security $security): null|Response
     {
         try {
             $token = $request->get('token');

250) /var/www/html/src/Account/Ui/Authentication/Registration/RegistrationController.php:84    [M] Identical

--- Original
+++ New
@@ @@
     {
         try {
             $token = $request->get('token');
-            if (null === $token || false === is_string($token)) {
+            if (null !== $token || false === is_string($token)) {
                 throw new TokenNotFoundException();
             }
             $user = $this->createUserService->setAsVerified($token);

251) /var/www/html/src/Account/Ui/Authentication/Registration/RegistrationController.php:84    [M] FalseValue

--- Original
+++ New
@@ @@
     {
         try {
             $token = $request->get('token');
-            if (null === $token || false === is_string($token)) {
+            if (null === $token || true === is_string($token)) {
                 throw new TokenNotFoundException();
             }
             $user = $this->createUserService->setAsVerified($token);

252) /var/www/html/src/Account/Ui/Authentication/Registration/RegistrationController.php:84    [M] Identical

--- Original
+++ New
@@ @@
     {
         try {
             $token = $request->get('token');
-            if (null === $token || false === is_string($token)) {
+            if (null === $token || false !== is_string($token)) {
                 throw new TokenNotFoundException();
             }
             $user = $this->createUserService->setAsVerified($token);

253) /var/www/html/src/Account/Ui/Authentication/Registration/RegistrationController.php:84    [M] LogicalOr

--- Original
+++ New
@@ @@
     {
         try {
             $token = $request->get('token');
-            if (null === $token || false === is_string($token)) {
+            if (null === $token && false === is_string($token)) {
                 throw new TokenNotFoundException();
             }
             $user = $this->createUserService->setAsVerified($token);

254) /var/www/html/src/Account/Ui/Authentication/Registration/RegistrationController.php:84    [M] LogicalOrAllSubExprNegation

--- Original
+++ New
@@ @@
     {
         try {
             $token = $request->get('token');
-            if (null === $token || false === is_string($token)) {
+            if (!(null === $token) || false === is_string($token)) {
                 throw new TokenNotFoundException();
             }
             $user = $this->createUserService->setAsVerified($token);

255) /var/www/html/src/Account/Ui/Authentication/Registration/RegistrationController.php:84    [M] LogicalOrNegation

--- Original
+++ New
@@ @@
     {
         try {
             $token = $request->get('token');
-            if (null === $token || false === is_string($token)) {
+            if (!(null === $token || false === is_string($token))) {
                 throw new TokenNotFoundException();
             }
             $user = $this->createUserService->setAsVerified($token);
