3) /var/www/html/src/Account/Application/AccountAuthenticatorService.php:31    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->urlGenerator->generate(self::DASHBOARD_ROUTE);
     }
-    public function isVerified(Request $request): bool
+    protected function isVerified(Request $request): bool
     {
         $email = $request->request->all('login_form')['email'] ?? '';
         $user = $this->userRepository->getByEmail($email);

4) /var/www/html/src/Account/Application/AccountAuthenticatorService.php:33    [M] Coalesce

--- Original
+++ New
@@ @@
     }
     public function isVerified(Request $request): bool
     {
-        $email = $request->request->all('login_form')['email'] ?? '';
+        $email = '' ?? $request->request->all('login_form')['email'];
         $user = $this->userRepository->getByEmail($email);
         return (bool) $user?->isVerified();
     }
 }

5) /var/www/html/src/Account/Application/AccountAuthenticatorService.php:36    [M] NullSafeMethodCall

--- Original
+++ New
@@ @@
     {
         $email = $request->request->all('login_form')['email'] ?? '';
         $user = $this->userRepository->getByEmail($email);
-        return (bool) $user?->isVerified();
+        return (bool) $user->isVerified();
     }
 }

6) /var/www/html/src/Account/Application/AccountAuthenticatorService.php:36    [M] CastBool

--- Original
+++ New
@@ @@
     {
         $email = $request->request->all('login_form')['email'] ?? '';
         $user = $this->userRepository->getByEmail($email);
-        return (bool) $user?->isVerified();
+        return $user?->isVerified();
     }
 }

7) /var/www/html/src/Account/Application/AccountMailerService.php:27    [M] PublicVisibility

--- Original
+++ New
@@ @@
     /**
      * @throws CannotSendEmailException
      */
-    public function sendRegistrationConfirmationEmail(string $email, PasswordToken $passwordToken): void
+    protected function sendRegistrationConfirmationEmail(string $email, PasswordToken $passwordToken): void
     {
         $this->sendEmailToUser($email, 'dashboard.authentication.register.confirmation.title', 'dashboard/authentication/registration/confirmation-email-template.html.twig', ['token' => $passwordToken->getToken()], 'An error occurred while sending registration confirmation email.');
     }

8) /var/www/html/src/Account/Application/AccountMailerService.php:29    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
      */
     public function sendRegistrationConfirmationEmail(string $email, PasswordToken $passwordToken): void
     {
-        $this->sendEmailToUser($email, 'dashboard.authentication.register.confirmation.title', 'dashboard/authentication/registration/confirmation-email-template.html.twig', ['token' => $passwordToken->getToken()], 'An error occurred while sending registration confirmation email.');
+        
     }
     /**
      * @throws CannotSendEmailException

9) /var/www/html/src/Account/Application/AccountMailerService.php:33    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
      */
     public function sendRegistrationConfirmationEmail(string $email, PasswordToken $passwordToken): void
     {
-        $this->sendEmailToUser($email, 'dashboard.authentication.register.confirmation.title', 'dashboard/authentication/registration/confirmation-email-template.html.twig', ['token' => $passwordToken->getToken()], 'An error occurred while sending registration confirmation email.');
+        $this->sendEmailToUser($email, 'dashboard.authentication.register.confirmation.title', 'dashboard/authentication/registration/confirmation-email-template.html.twig', [], 'An error occurred while sending registration confirmation email.');
     }
     /**
      * @throws CannotSendEmailException

10) /var/www/html/src/Account/Application/AccountMailerService.php:34    [M] ArrayItem

--- Original
+++ New
@@ @@
      */
     public function sendRegistrationConfirmationEmail(string $email, PasswordToken $passwordToken): void
     {
-        $this->sendEmailToUser($email, 'dashboard.authentication.register.confirmation.title', 'dashboard/authentication/registration/confirmation-email-template.html.twig', ['token' => $passwordToken->getToken()], 'An error occurred while sending registration confirmation email.');
+        $this->sendEmailToUser($email, 'dashboard.authentication.register.confirmation.title', 'dashboard/authentication/registration/confirmation-email-template.html.twig', ['token' > $passwordToken->getToken()], 'An error occurred while sending registration confirmation email.');
     }
     /**
      * @throws CannotSendEmailException

11) /var/www/html/src/Account/Application/AccountMailerService.php:43    [M] PublicVisibility

--- Original
+++ New
@@ @@
     /**
      * @throws CannotSendEmailException
      */
-    public function sendResetPasswordEmail(string $email, PasswordToken $passwordToken): void
+    protected function sendResetPasswordEmail(string $email, PasswordToken $passwordToken): void
     {
         $this->sendEmailToUser($email, 'dashboard.authentication.resetPassword.title', 'dashboard/authentication/resetPassword/reset-password-email-template.html.twig', ['token' => $passwordToken->getToken(), 'emailValue' => $email], 'An error occurred while sending reset password email.');
     }

12) /var/www/html/src/Account/Application/AccountMailerService.php:45    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
      */
     public function sendResetPasswordEmail(string $email, PasswordToken $passwordToken): void
     {
-        $this->sendEmailToUser($email, 'dashboard.authentication.resetPassword.title', 'dashboard/authentication/resetPassword/reset-password-email-template.html.twig', ['token' => $passwordToken->getToken(), 'emailValue' => $email], 'An error occurred while sending reset password email.');
+        
     }
     /**
      * @param array<string, mixed> $context

13) /var/www/html/src/Account/Application/AccountMailerService.php:49    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
      */
     public function sendResetPasswordEmail(string $email, PasswordToken $passwordToken): void
     {
-        $this->sendEmailToUser($email, 'dashboard.authentication.resetPassword.title', 'dashboard/authentication/resetPassword/reset-password-email-template.html.twig', ['token' => $passwordToken->getToken(), 'emailValue' => $email], 'An error occurred while sending reset password email.');
+        $this->sendEmailToUser($email, 'dashboard.authentication.resetPassword.title', 'dashboard/authentication/resetPassword/reset-password-email-template.html.twig', ['emailValue' => $email], 'An error occurred while sending reset password email.');
     }
     /**
      * @param array<string, mixed> $context

14) /var/www/html/src/Account/Application/AccountMailerService.php:50    [M] ArrayItem

--- Original
+++ New
@@ @@
      */
     public function sendResetPasswordEmail(string $email, PasswordToken $passwordToken): void
     {
-        $this->sendEmailToUser($email, 'dashboard.authentication.resetPassword.title', 'dashboard/authentication/resetPassword/reset-password-email-template.html.twig', ['token' => $passwordToken->getToken(), 'emailValue' => $email], 'An error occurred while sending reset password email.');
+        $this->sendEmailToUser($email, 'dashboard.authentication.resetPassword.title', 'dashboard/authentication/resetPassword/reset-password-email-template.html.twig', ['token' > $passwordToken->getToken(), 'emailValue' => $email], 'An error occurred while sending reset password email.');
     }
     /**
      * @param array<string, mixed> $context

23) /var/www/html/src/Account/Application/CreateUserService.php:31    [M] PublicVisibility

--- Original
+++ New
@@ @@
     /**
      * @throws CreateNewUserException
      */
-    public function createUser(string $email, string $password, bool $sendConfirmationEmail = true): User
+    protected function createUser(string $email, string $password, bool $sendConfirmationEmail = true): User
     {
         $this->entityManager->beginTransaction();
         try {

24) /var/www/html/src/Account/Application/CreateUserService.php:34    [M] TrueValue

--- Original
+++ New
@@ @@
     /**
      * @throws CreateNewUserException
      */
-    public function createUser(string $email, string $password, bool $sendConfirmationEmail = true): User
+    public function createUser(string $email, string $password, bool $sendConfirmationEmail = false): User
     {
         $this->entityManager->beginTransaction();
         try {

25) /var/www/html/src/Account/Application/CreateUserService.php:36    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
      */
     public function createUser(string $email, string $password, bool $sendConfirmationEmail = true): User
     {
-        $this->entityManager->beginTransaction();
+        
         try {
             $user = $this->userFactory->create($email, $password);
             $this->userRepository->save($user);

28) /var/www/html/src/Account/Application/CreateUserService.php:42    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             $user = $this->userFactory->create($email, $password);
             $this->userRepository->save($user);
             if ($sendConfirmationEmail) {
-                $this->accountMailerService->sendRegistrationConfirmationEmail($email, $this->tokenService->generateTokenForVerifyAccount($user));
+                
             }
             $this->entityManager->commit();
         } catch (\Throwable $e) {

29) /var/www/html/src/Account/Application/CreateUserService.php:47    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             if ($sendConfirmationEmail) {
                 $this->accountMailerService->sendRegistrationConfirmationEmail($email, $this->tokenService->generateTokenForVerifyAccount($user));
             }
-            $this->entityManager->commit();
+            
         } catch (\Throwable $e) {
             $this->entityManager->rollback();
             $this->logger->error('An error occurred while creating a new user.', ['exception' => $e, 'email' => $email, 'class' => __CLASS__]);

30) /var/www/html/src/Account/Application/CreateUserService.php:49    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             }
             $this->entityManager->commit();
         } catch (\Throwable $e) {
-            $this->entityManager->rollback();
+            
             $this->logger->error('An error occurred while creating a new user.', ['exception' => $e, 'email' => $email, 'class' => __CLASS__]);
             throw new CreateNewUserException();
         }

31) /var/www/html/src/Account/Application/CreateUserService.php:50    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             $this->entityManager->commit();
         } catch (\Throwable $e) {
             $this->entityManager->rollback();
-            $this->logger->error('An error occurred while creating a new user.', ['exception' => $e, 'email' => $email, 'class' => __CLASS__]);
+            
             throw new CreateNewUserException();
         }
         return $user;

32) /var/www/html/src/Account/Application/CreateUserService.php:52    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
             $this->entityManager->commit();
         } catch (\Throwable $e) {
             $this->entityManager->rollback();
-            $this->logger->error('An error occurred while creating a new user.', ['exception' => $e, 'email' => $email, 'class' => __CLASS__]);
+            $this->logger->error('An error occurred while creating a new user.', ['email' => $email, 'class' => __CLASS__]);
             throw new CreateNewUserException();
         }
         return $user;

34) /var/www/html/src/Account/Application/CreateUserService.php:69    [M] PublicVisibility

--- Original
+++ New
@@ @@
     /**
      * @throws TokenNotFoundException
      */
-    public function setAsVerified(string $token): User
+    protected function setAsVerified(string $token): User
     {
         try {
             $passwordToken = $this->passwordTokenRepository->getByToken($token, new \DateTimeImmutable('now'));

35) /var/www/html/src/Account/Application/CreateUserService.php:74    [M] Identical

--- Original
+++ New
@@ @@
     {
         try {
             $passwordToken = $this->passwordTokenRepository->getByToken($token, new \DateTimeImmutable('now'));
-            if (null === $passwordToken) {
+            if (null !== $passwordToken) {
                 throw new TokenNotFoundException();
             }
             $passwordToken->setAsVerified();

36) /var/www/html/src/Account/Application/CreateUserService.php:75    [M] Throw_

--- Original
+++ New
@@ @@
         try {
             $passwordToken = $this->passwordTokenRepository->getByToken($token, new \DateTimeImmutable('now'));
             if (null === $passwordToken) {
-                throw new TokenNotFoundException();
+                new TokenNotFoundException();
             }
             $passwordToken->setAsVerified();
             $user = $passwordToken->getUser();

37) /var/www/html/src/Account/Application/CreateUserService.php:77    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             if (null === $passwordToken) {
                 throw new TokenNotFoundException();
             }
-            $passwordToken->setAsVerified();
+            
             $user = $passwordToken->getUser();
             $this->passwordTokenRepository->save($passwordToken);
             $this->userRepository->save($user);

38) /var/www/html/src/Account/Application/CreateUserService.php:79    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             }
             $passwordToken->setAsVerified();
             $user = $passwordToken->getUser();
-            $this->passwordTokenRepository->save($passwordToken);
+            
             $this->userRepository->save($user);
             return $user;
         } catch (\Throwable $exception) {

39) /var/www/html/src/Account/Application/CreateUserService.php:80    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             $passwordToken->setAsVerified();
             $user = $passwordToken->getUser();
             $this->passwordTokenRepository->save($passwordToken);
-            $this->userRepository->save($user);
+            
             return $user;
         } catch (\Throwable $exception) {
             $this->logger->error('An error occurred while deactivating password token.', ['exception' => $exception, 'token' => $token, 'class' => __CLASS__]);

40) /var/www/html/src/Account/Application/CreateUserService.php:84    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             $this->userRepository->save($user);
             return $user;
         } catch (\Throwable $exception) {
-            $this->logger->error('An error occurred while deactivating password token.', ['exception' => $exception, 'token' => $token, 'class' => __CLASS__]);
+            
             throw new TokenNotFoundException();
         }
     }
 }

41) /var/www/html/src/Account/Application/CreateUserService.php:86    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
             $this->userRepository->save($user);
             return $user;
         } catch (\Throwable $exception) {
-            $this->logger->error('An error occurred while deactivating password token.', ['exception' => $exception, 'token' => $token, 'class' => __CLASS__]);
+            $this->logger->error('An error occurred while deactivating password token.', ['token' => $token, 'class' => __CLASS__]);
             throw new TokenNotFoundException();
         }
     }
 }

42) /var/www/html/src/Account/Application/CreateUserService.php:93    [M] Throw_

--- Original
+++ New
@@ @@
             return $user;
         } catch (\Throwable $exception) {
             $this->logger->error('An error occurred while deactivating password token.', ['exception' => $exception, 'token' => $token, 'class' => __CLASS__]);
-            throw new TokenNotFoundException();
+            new TokenNotFoundException();
         }
     }
 }

152) /var/www/html/src/Account/Domain/UserFactory.php:23    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $user->setEmail($email);
         $hashedPassword = $this->userPasswordHasher->hashPassword($user, $password);
         $user->setPassword($hashedPassword);
-        $user->setAsAdmin();
+        
         return $user;
     }
 }
