256) /var/www/html/src/Account/Ui/Authentication/Registration/RegistrationController.php:85    [M] Throw_

--- Original
+++ New
@@ @@
         try {
             $token = $request->get('token');
             if (null === $token || false === is_string($token)) {
-                throw new TokenNotFoundException();
+                new TokenNotFoundException();
             }
             $user = $this->createUserService->setAsVerified($token);
             $this->flasher->success('dashboard.authentication.register.confirm.success.description', 'dashboard.authentication.register.confirm.success.title');

257) /var/www/html/src/Account/Ui/Authentication/Registration/RegistrationController.php:90    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
                 throw new TokenNotFoundException();
             }
             $user = $this->createUserService->setAsVerified($token);
-            $this->flasher->success('dashboard.authentication.register.confirm.success.description', 'dashboard.authentication.register.confirm.success.title');
+            
             return $security->login($user, AccountAuthenticator::class, 'main');
         } catch (TokenNotFoundException $exception) {
             $this->flasher->error($exception->getMessage(), 'dashboard.authentication.register.confirm.error.tokenNotFound.title');

258) /var/www/html/src/Account/Ui/Authentication/Registration/RegistrationController.php:97    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             $this->flasher->success('dashboard.authentication.register.confirm.success.description', 'dashboard.authentication.register.confirm.success.title');
             return $security->login($user, AccountAuthenticator::class, 'main');
         } catch (TokenNotFoundException $exception) {
-            $this->flasher->error($exception->getMessage(), 'dashboard.authentication.register.confirm.error.tokenNotFound.title');
+            
         } catch (\Throwable) {
             $this->flasher->error('dashboard.authentication.register.confirm.error.description', 'dashboard.authentication.register.confirm.error.title');
             return $this->redirectToRoute('app_register');

259) /var/www/html/src/Account/Ui/Authentication/Registration/RegistrationController.php:102    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         } catch (TokenNotFoundException $exception) {
             $this->flasher->error($exception->getMessage(), 'dashboard.authentication.register.confirm.error.tokenNotFound.title');
         } catch (\Throwable) {
-            $this->flasher->error('dashboard.authentication.register.confirm.error.description', 'dashboard.authentication.register.confirm.error.title');
+            
             return $this->redirectToRoute('app_register');
         }
         return $this->redirectToRoute('app_register');
     }
 }

272) /var/www/html/src/Account/Ui/Authentication/ResetPassword/ResetPasswordController.php:35    [M] Identical

--- Original
+++ New
@@ @@
                 $token = $request->get('token');
                 $email = $request->get('emailValue');
                 $password = $form->get('password')->getData();
-                if (null === $password || false === is_string($password)) {
+                if (null !== $password || false === is_string($password)) {
                     throw new PasswordRequiredException();
                 }
                 if (null === $token || false === is_string($token)) {

273) /var/www/html/src/Account/Ui/Authentication/ResetPassword/ResetPasswordController.php:35    [M] FalseValue

--- Original
+++ New
@@ @@
                 $token = $request->get('token');
                 $email = $request->get('emailValue');
                 $password = $form->get('password')->getData();
-                if (null === $password || false === is_string($password)) {
+                if (null === $password || true === is_string($password)) {
                     throw new PasswordRequiredException();
                 }
                 if (null === $token || false === is_string($token)) {

274) /var/www/html/src/Account/Ui/Authentication/ResetPassword/ResetPasswordController.php:35    [M] Identical

--- Original
+++ New
@@ @@
                 $token = $request->get('token');
                 $email = $request->get('emailValue');
                 $password = $form->get('password')->getData();
-                if (null === $password || false === is_string($password)) {
+                if (null === $password || false !== is_string($password)) {
                     throw new PasswordRequiredException();
                 }
                 if (null === $token || false === is_string($token)) {

275) /var/www/html/src/Account/Ui/Authentication/ResetPassword/ResetPasswordController.php:35    [M] LogicalOr

--- Original
+++ New
@@ @@
                 $token = $request->get('token');
                 $email = $request->get('emailValue');
                 $password = $form->get('password')->getData();
-                if (null === $password || false === is_string($password)) {
+                if (null === $password && false === is_string($password)) {
                     throw new PasswordRequiredException();
                 }
                 if (null === $token || false === is_string($token)) {

276) /var/www/html/src/Account/Ui/Authentication/ResetPassword/ResetPasswordController.php:35    [M] LogicalOrAllSubExprNegation

--- Original
+++ New
@@ @@
                 $token = $request->get('token');
                 $email = $request->get('emailValue');
                 $password = $form->get('password')->getData();
-                if (null === $password || false === is_string($password)) {
+                if (!(null === $password) || false === is_string($password)) {
                     throw new PasswordRequiredException();
                 }
                 if (null === $token || false === is_string($token)) {

277) /var/www/html/src/Account/Ui/Authentication/ResetPassword/ResetPasswordController.php:35    [M] LogicalOrNegation

--- Original
+++ New
@@ @@
                 $token = $request->get('token');
                 $email = $request->get('emailValue');
                 $password = $form->get('password')->getData();
-                if (null === $password || false === is_string($password)) {
+                if (!(null === $password || false === is_string($password))) {
                     throw new PasswordRequiredException();
                 }
                 if (null === $token || false === is_string($token)) {

279) /var/www/html/src/Account/Ui/Authentication/ResetPassword/ResetPasswordController.php:39    [M] Identical

--- Original
+++ New
@@ @@
                 if (null === $password || false === is_string($password)) {
                     throw new PasswordRequiredException();
                 }
-                if (null === $token || false === is_string($token)) {
+                if (null !== $token || false === is_string($token)) {
                     throw new TokenNotFoundException();
                 }
                 if (null === $email || false === is_string($email)) {

280) /var/www/html/src/Account/Ui/Authentication/ResetPassword/ResetPasswordController.php:39    [M] FalseValue

--- Original
+++ New
@@ @@
                 if (null === $password || false === is_string($password)) {
                     throw new PasswordRequiredException();
                 }
-                if (null === $token || false === is_string($token)) {
+                if (null === $token || true === is_string($token)) {
                     throw new TokenNotFoundException();
                 }
                 if (null === $email || false === is_string($email)) {

281) /var/www/html/src/Account/Ui/Authentication/ResetPassword/ResetPasswordController.php:39    [M] Identical

--- Original
+++ New
@@ @@
                 if (null === $password || false === is_string($password)) {
                     throw new PasswordRequiredException();
                 }
-                if (null === $token || false === is_string($token)) {
+                if (null === $token || false !== is_string($token)) {
                     throw new TokenNotFoundException();
                 }
                 if (null === $email || false === is_string($email)) {

282) /var/www/html/src/Account/Ui/Authentication/ResetPassword/ResetPasswordController.php:39    [M] LogicalOr

--- Original
+++ New
@@ @@
                 if (null === $password || false === is_string($password)) {
                     throw new PasswordRequiredException();
                 }
-                if (null === $token || false === is_string($token)) {
+                if (null === $token && false === is_string($token)) {
                     throw new TokenNotFoundException();
                 }
                 if (null === $email || false === is_string($email)) {

283) /var/www/html/src/Account/Ui/Authentication/ResetPassword/ResetPasswordController.php:39    [M] LogicalOrAllSubExprNegation

--- Original
+++ New
@@ @@
                 if (null === $password || false === is_string($password)) {
                     throw new PasswordRequiredException();
                 }
-                if (null === $token || false === is_string($token)) {
+                if (!(null === $token) || false === is_string($token)) {
                     throw new TokenNotFoundException();
                 }
                 if (null === $email || false === is_string($email)) {

284) /var/www/html/src/Account/Ui/Authentication/ResetPassword/ResetPasswordController.php:39    [M] LogicalOrNegation

--- Original
+++ New
@@ @@
                 if (null === $password || false === is_string($password)) {
                     throw new PasswordRequiredException();
                 }
-                if (null === $token || false === is_string($token)) {
+                if (!(null === $token || false === is_string($token))) {
                     throw new TokenNotFoundException();
                 }
                 if (null === $email || false === is_string($email)) {

286) /var/www/html/src/Account/Ui/Authentication/ResetPassword/ResetPasswordController.php:43    [M] Identical

--- Original
+++ New
@@ @@
                 if (null === $token || false === is_string($token)) {
                     throw new TokenNotFoundException();
                 }
-                if (null === $email || false === is_string($email)) {
+                if (null !== $email || false === is_string($email)) {
                     throw new UserNotFoundException();
                 }
                 $this->resetPasswordService->resetPassword($token, $email, $password);

287) /var/www/html/src/Account/Ui/Authentication/ResetPassword/ResetPasswordController.php:43    [M] FalseValue

--- Original
+++ New
@@ @@
                 if (null === $token || false === is_string($token)) {
                     throw new TokenNotFoundException();
                 }
-                if (null === $email || false === is_string($email)) {
+                if (null === $email || true === is_string($email)) {
                     throw new UserNotFoundException();
                 }
                 $this->resetPasswordService->resetPassword($token, $email, $password);

288) /var/www/html/src/Account/Ui/Authentication/ResetPassword/ResetPasswordController.php:43    [M] Identical

--- Original
+++ New
@@ @@
                 if (null === $token || false === is_string($token)) {
                     throw new TokenNotFoundException();
                 }
-                if (null === $email || false === is_string($email)) {
+                if (null === $email || false !== is_string($email)) {
                     throw new UserNotFoundException();
                 }
                 $this->resetPasswordService->resetPassword($token, $email, $password);

289) /var/www/html/src/Account/Ui/Authentication/ResetPassword/ResetPasswordController.php:43    [M] LogicalOr

--- Original
+++ New
@@ @@
                 if (null === $token || false === is_string($token)) {
                     throw new TokenNotFoundException();
                 }
-                if (null === $email || false === is_string($email)) {
+                if (null === $email && false === is_string($email)) {
                     throw new UserNotFoundException();
                 }
                 $this->resetPasswordService->resetPassword($token, $email, $password);

290) /var/www/html/src/Account/Ui/Authentication/ResetPassword/ResetPasswordController.php:43    [M] LogicalOrAllSubExprNegation

--- Original
+++ New
@@ @@
                 if (null === $token || false === is_string($token)) {
                     throw new TokenNotFoundException();
                 }
-                if (null === $email || false === is_string($email)) {
+                if (!(null === $email) || false === is_string($email)) {
                     throw new UserNotFoundException();
                 }
                 $this->resetPasswordService->resetPassword($token, $email, $password);

291) /var/www/html/src/Account/Ui/Authentication/ResetPassword/ResetPasswordController.php:43    [M] LogicalOrNegation

--- Original
+++ New
@@ @@
                 if (null === $token || false === is_string($token)) {
                     throw new TokenNotFoundException();
                 }
-                if (null === $email || false === is_string($email)) {
+                if (!(null === $email || false === is_string($email))) {
                     throw new UserNotFoundException();
                 }
                 $this->resetPasswordService->resetPassword($token, $email, $password);

292) /var/www/html/src/Account/Ui/Authentication/ResetPassword/ResetPasswordController.php:44    [M] Throw_

--- Original
+++ New
@@ @@
                     throw new TokenNotFoundException();
                 }
                 if (null === $email || false === is_string($email)) {
-                    throw new UserNotFoundException();
+                    new UserNotFoundException();
                 }
                 $this->resetPasswordService->resetPassword($token, $email, $password);
                 $this->flasher->success('dashboard.authentication.resetPassword.success.description', 'dashboard.authentication.resetPassword.success.title');

293) /var/www/html/src/Account/Ui/Authentication/ResetPassword/ResetPasswordController.php:47    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
                 if (null === $email || false === is_string($email)) {
                     throw new UserNotFoundException();
                 }
-                $this->resetPasswordService->resetPassword($token, $email, $password);
+                
                 $this->flasher->success('dashboard.authentication.resetPassword.success.description', 'dashboard.authentication.resetPassword.success.title');
                 return $this->redirectToRoute('app_login');
             } catch (PasswordRequiredException $exception) {

294) /var/www/html/src/Account/Ui/Authentication/ResetPassword/ResetPasswordController.php:48    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
                     throw new UserNotFoundException();
                 }
                 $this->resetPasswordService->resetPassword($token, $email, $password);
-                $this->flasher->success('dashboard.authentication.resetPassword.success.description', 'dashboard.authentication.resetPassword.success.title');
+                
                 return $this->redirectToRoute('app_login');
             } catch (PasswordRequiredException $exception) {
                 $this->flasher->error($exception->getMessage(), 'dashboard.authentication.resetPassword.error.passwordRequired.title');

295) /var/www/html/src/Account/Ui/Authentication/ResetPassword/ResetPasswordController.php:55    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
                 $this->flasher->success('dashboard.authentication.resetPassword.success.description', 'dashboard.authentication.resetPassword.success.title');
                 return $this->redirectToRoute('app_login');
             } catch (PasswordRequiredException $exception) {
-                $this->flasher->error($exception->getMessage(), 'dashboard.authentication.resetPassword.error.passwordRequired.title');
+                
             } catch (ResetPasswordException $exception) {
                 $this->flasher->error($exception->getMessage(), 'dashboard.authentication.resetPassword.error.resetPassword.title');
             } catch (TokenNotFoundException $exception) {

296) /var/www/html/src/Account/Ui/Authentication/ResetPassword/ResetPasswordController.php:60    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             } catch (PasswordRequiredException $exception) {
                 $this->flasher->error($exception->getMessage(), 'dashboard.authentication.resetPassword.error.passwordRequired.title');
             } catch (ResetPasswordException $exception) {
-                $this->flasher->error($exception->getMessage(), 'dashboard.authentication.resetPassword.error.resetPassword.title');
+                
             } catch (TokenNotFoundException $exception) {
                 $this->flasher->error($exception->getMessage(), 'dashboard.authentication.resetPassword.error.tokenNotFound.title');
             } catch (UserNotFoundException $exception) {

297) /var/www/html/src/Account/Ui/Authentication/ResetPassword/ResetPasswordController.php:65    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             } catch (ResetPasswordException $exception) {
                 $this->flasher->error($exception->getMessage(), 'dashboard.authentication.resetPassword.error.resetPassword.title');
             } catch (TokenNotFoundException $exception) {
-                $this->flasher->error($exception->getMessage(), 'dashboard.authentication.resetPassword.error.tokenNotFound.title');
+                
             } catch (UserNotFoundException $exception) {
                 $this->flasher->error($exception->getMessage(), 'dashboard.authentication.resetPassword.error.userNotFound.title');
             } catch (\Throwable) {

298) /var/www/html/src/Account/Ui/Authentication/ResetPassword/ResetPasswordController.php:70    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             } catch (TokenNotFoundException $exception) {
                 $this->flasher->error($exception->getMessage(), 'dashboard.authentication.resetPassword.error.tokenNotFound.title');
             } catch (UserNotFoundException $exception) {
-                $this->flasher->error($exception->getMessage(), 'dashboard.authentication.resetPassword.error.userNotFound.title');
+                
             } catch (\Throwable) {
                 $this->flasher->error('dashboard.authentication.resetPassword.error.description', 'dashboard.authentication.resetPassword.error.title');
             }

299) /var/www/html/src/Account/Ui/Authentication/ResetPassword/ResetPasswordController.php:75    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             } catch (UserNotFoundException $exception) {
                 $this->flasher->error($exception->getMessage(), 'dashboard.authentication.resetPassword.error.userNotFound.title');
             } catch (\Throwable) {
-                $this->flasher->error('dashboard.authentication.resetPassword.error.description', 'dashboard.authentication.resetPassword.error.title');
+                
             }
         }
         return $this->render('dashboard/authentication/resetPassword/reset-password.html.twig', ['resetPasswordForm' => $form]);
     }
 }
