1) /var/www/html/src/Kernel/EventSubscriber/TimestampableSubscriber.php:45    [M] NullSafeMethodCall

--- Original
+++ New
@@ @@
         try {
             $user = $this->security->getUser();
             if (null === $entity->getCreatedBy()) {
-                $entity->setCreatedBy($user?->getUserIdentifier());
+                $entity->setCreatedBy($user->getUserIdentifier());
             }
             $entity->setUpdatedBy($user?->getUserIdentifier());
         } catch (\Throwable $exception) {

2) /var/www/html/src/Kernel/EventSubscriber/TimestampableSubscriber.php:48    [M] NullSafeMethodCall

--- Original
+++ New
@@ @@
             if (null === $entity->getCreatedBy()) {
                 $entity->setCreatedBy($user?->getUserIdentifier());
             }
-            $entity->setUpdatedBy($user?->getUserIdentifier());
+            $entity->setUpdatedBy($user->getUserIdentifier());
         } catch (\Throwable $exception) {
             $this->logger->error('Setting user data for resource failed.', ['exception' => $exception, 'class' => TimestampableSubscriber::class]);
         }

3) /var/www/html/src/Kernel/EventSubscriber/TimestampableSubscriber.php:48    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             if (null === $entity->getCreatedBy()) {
                 $entity->setCreatedBy($user?->getUserIdentifier());
             }
-            $entity->setUpdatedBy($user?->getUserIdentifier());
+            
         } catch (\Throwable $exception) {
             $this->logger->error('Setting user data for resource failed.', ['exception' => $exception, 'class' => TimestampableSubscriber::class]);
         }

4) /var/www/html/src/Kernel/EventSubscriber/TimestampableSubscriber.php:66    [M] InstanceOf_

--- Original
+++ New
@@ @@
     public function preUpdate(LifecycleEventArgs $args): void
     {
         $entity = $args->getObject();
-        if (!$entity instanceof TimestampableResourceInterface) {
+        if (!true) {
             return;
         }
         $entity->setUpdatedAt($this->getDateTimeNow());

5) /var/www/html/src/Kernel/EventSubscriber/TimestampableSubscriber.php:74    [M] NullSafeMethodCall

--- Original
+++ New
@@ @@
         $entity->setUpdatedAt($this->getDateTimeNow());
         try {
             $user = $this->security->getUser();
-            $entity->setUpdatedBy($user?->getUserIdentifier());
+            $entity->setUpdatedBy($user->getUserIdentifier());
         } catch (\Throwable $exception) {
             $this->logger->error('Setting user data for resource failed.', ['exception' => $exception, 'class' => TimestampableSubscriber::class]);
         }

7) /var/www/html/src/Kernel/EventSubscriber/TimestampableSubscriber.php:100    [M] NullSafeMethodCall

--- Original
+++ New
@@ @@
         $entity->setDeletedAt($this->getDateTimeNow());
         try {
             $user = $this->security->getUser();
-            $entity->setDeletedBy($user?->getUserIdentifier());
+            $entity->setDeletedBy($user->getUserIdentifier());
         } catch (\Throwable $exception) {
             $this->logger->error('Setting user data for resource failed.', ['exception' => $exception, 'class' => TimestampableSubscriber::class]);
         }


Timed Out mutants:
==================

1) /var/www/html/src/Account/Application/AccountAuthenticatorService.php:18    [M] PublicVisibility

--- Original
+++ New
@@ @@
     public function __construct(private readonly UrlGeneratorInterface $urlGenerator)
     {
     }
-    public function getLoginUrl(): string
+    protected function getLoginUrl(): string
     {
         return $this->urlGenerator->generate(self::LOGIN_ROUTE);
     }

2) /var/www/html/src/Account/Application/AccountAuthenticatorService.php:23    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->urlGenerator->generate(self::LOGIN_ROUTE);
     }
-    public function getPanelDashboardUrl(): string
+    protected function getPanelDashboardUrl(): string
     {
         return $this->urlGenerator->generate(self::DASHBOARD_ROUTE);
     }
 }

3) /var/www/html/src/Account/Application/AccountMailerService.php:27    [M] PublicVisibility

--- Original
+++ New
@@ @@
      * @param array<string, mixed> $context
      * @throws CannotSendEmailException
      */
-    public function sendEmailToUser(string $email, string $translationSubjectKey, string $twigTemplatePath, array $context = [], string $logReason = 'An error occurred while sending email.'): void
+    protected function sendEmailToUser(string $email, string $translationSubjectKey, string $twigTemplatePath, array $context = [], string $logReason = 'An error occurred while sending email.'): void
     {
         if (empty($this->companyEmail) || empty($this->companyName)) {
             throw new \LogicException('Company data is missing, please check CT_NAME, CT_EMAIL env configuration variables.');

4) /var/www/html/src/Account/Application/AccountMailerService.php:34    [M] LogicalOr

--- Original
+++ New
@@ @@
      */
     public function sendEmailToUser(string $email, string $translationSubjectKey, string $twigTemplatePath, array $context = [], string $logReason = 'An error occurred while sending email.'): void
     {
-        if (empty($this->companyEmail) || empty($this->companyName)) {
+        if (empty($this->companyEmail) && empty($this->companyName)) {
             throw new \LogicException('Company data is missing, please check CT_NAME, CT_EMAIL env configuration variables.');
         }
         $context['companyName'] = $this->companyName;

5) /var/www/html/src/Account/Application/AccountMailerService.php:34    [M] LogicalOrAllSubExprNegation

--- Original
+++ New
@@ @@
      */
     public function sendEmailToUser(string $email, string $translationSubjectKey, string $twigTemplatePath, array $context = [], string $logReason = 'An error occurred while sending email.'): void
     {
-        if (empty($this->companyEmail) || empty($this->companyName)) {
+        if (!empty($this->companyEmail) || !empty($this->companyName)) {
             throw new \LogicException('Company data is missing, please check CT_NAME, CT_EMAIL env configuration variables.');
         }
         $context['companyName'] = $this->companyName;

6) /var/www/html/src/Account/Application/AccountMailerService.php:34    [M] LogicalOrNegation

--- Original
+++ New
@@ @@
      */
     public function sendEmailToUser(string $email, string $translationSubjectKey, string $twigTemplatePath, array $context = [], string $logReason = 'An error occurred while sending email.'): void
     {
-        if (empty($this->companyEmail) || empty($this->companyName)) {
+        if (!(empty($this->companyEmail) || empty($this->companyName))) {
             throw new \LogicException('Company data is missing, please check CT_NAME, CT_EMAIL env configuration variables.');
         }
         $context['companyName'] = $this->companyName;

7) /var/www/html/src/Account/Application/AccountMailerService.php:35    [M] Throw_

--- Original
+++ New
@@ @@
     public function sendEmailToUser(string $email, string $translationSubjectKey, string $twigTemplatePath, array $context = [], string $logReason = 'An error occurred while sending email.'): void
     {
         if (empty($this->companyEmail) || empty($this->companyName)) {
-            throw new \LogicException('Company data is missing, please check CT_NAME, CT_EMAIL env configuration variables.');
+            new \LogicException('Company data is missing, please check CT_NAME, CT_EMAIL env configuration variables.');
         }
         $context['companyName'] = $this->companyName;
         /** @infection-ignore-all  */

8) /var/www/html/src/Account/Application/AccountMailerService.php:48    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         /** @infection-ignore-all  */
         $email = (new TemplatedEmail())->from(new Address($this->companyEmail, $this->companyName))->to(new Address($email))->subject($this->translator->trans($translationSubjectKey))->htmlTemplate($twigTemplatePath)->context($context);
         try {
-            $this->mailer->send($email);
+            
         } catch (\Throwable $exception) {
             $this->logger->critical($logReason, ['exception' => $exception, 'email' => $email, 'class' => __CLASS__]);
             throw new CannotSendEmailException();

9) /var/www/html/src/Account/Application/AccountMailerService.php:50    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         try {
             $this->mailer->send($email);
         } catch (\Throwable $exception) {
-            $this->logger->critical($logReason, ['exception' => $exception, 'email' => $email, 'class' => __CLASS__]);
+            
             throw new CannotSendEmailException();
         }
     }
 }

10) /var/www/html/src/Account/Application/AccountMailerService.php:52    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         try {
             $this->mailer->send($email);
         } catch (\Throwable $exception) {
-            $this->logger->critical($logReason, ['exception' => $exception, 'email' => $email, 'class' => __CLASS__]);
+            $this->logger->critical($logReason, ['email' => $email, 'class' => __CLASS__]);
             throw new CannotSendEmailException();
         }
     }
 }

11) /var/www/html/src/Account/Application/AccountMailerService.php:58    [M] Throw_

--- Original
+++ New
@@ @@
             $this->mailer->send($email);
         } catch (\Throwable $exception) {
             $this->logger->critical($logReason, ['exception' => $exception, 'email' => $email, 'class' => __CLASS__]);
-            throw new CannotSendEmailException();
+            new CannotSendEmailException();
         }
     }
 }

40) /var/www/html/src/Account/Application/UserManagerService.php:82    [M] PublicVisibility

--- Original
+++ New
@@ @@
             $this->updatePassword($user, $newPassword);
         };
     }
-    public function checkPasswordMatchActual(User $user, string $password): bool
+    protected function checkPasswordMatchActual(User $user, string $password): bool
     {
         return $this->passwordHasher->isPasswordValid($user, $password);
     }

41) /var/www/html/src/Account/Application/UserManagerService.php:87    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->passwordHasher->isPasswordValid($user, $password);
     }
-    public function updatePassword(User $user, mixed $password): ?string
+    protected function updatePassword(User $user, mixed $password): ?string
     {
         $passwordHashed = $this->passwordHasher->hashPassword($user, $password);
         $this->userRepository->upgradePassword($user, $passwordHashed);

42) /var/www/html/src/Account/Application/UserManagerService.php:90    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public function updatePassword(User $user, mixed $password): ?string
     {
         $passwordHashed = $this->passwordHasher->hashPassword($user, $password);
-        $this->userRepository->upgradePassword($user, $passwordHashed);
+        
         return $passwordHashed;
     }
     /**

43) /var/www/html/src/Account/Application/UserManagerService.php:98    [M] PublicVisibility

--- Original
+++ New
@@ @@
     /**
      * @throws CreateNewUserException
      */
-    public function createNewUser(string $email, string $password, bool $sendConfirmationEmail = true): User
+    protected function createNewUser(string $email, string $password, bool $sendConfirmationEmail = true): User
     {
         try {
             $user = $this->userFactory->create($email, $password);

44) /var/www/html/src/Account/Application/UserManagerService.php:101    [M] TrueValue

--- Original
+++ New
@@ @@
     /**
      * @throws CreateNewUserException
      */
-    public function createNewUser(string $email, string $password, bool $sendConfirmationEmail = true): User
+    public function createNewUser(string $email, string $password, bool $sendConfirmationEmail = false): User
     {
         try {
             $user = $this->userFactory->create($email, $password);

45) /var/www/html/src/Account/Application/UserManagerService.php:105    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         try {
             $user = $this->userFactory->create($email, $password);
-            $this->userRepository->save($user);
+            
             if ($sendConfirmationEmail) {
                 $this->sendRegistrationConfirmationEmail($email);
             }

46) /var/www/html/src/Account/Application/UserManagerService.php:107    [M] IfNegation

--- Original
+++ New
@@ @@
         try {
             $user = $this->userFactory->create($email, $password);
             $this->userRepository->save($user);
-            if ($sendConfirmationEmail) {
+            if (!$sendConfirmationEmail) {
                 $this->sendRegistrationConfirmationEmail($email);
             }
         } catch (\Throwable $e) {

47) /var/www/html/src/Account/Application/UserManagerService.php:108    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             $user = $this->userFactory->create($email, $password);
             $this->userRepository->save($user);
             if ($sendConfirmationEmail) {
-                $this->sendRegistrationConfirmationEmail($email);
+                
             }
         } catch (\Throwable $e) {
             $this->logger->error('An error occurred while creating a new user.', ['exception' => $e, 'email' => $email, 'class' => __CLASS__]);

48) /var/www/html/src/Account/Application/UserManagerService.php:111    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
                 $this->sendRegistrationConfirmationEmail($email);
             }
         } catch (\Throwable $e) {
-            $this->logger->error('An error occurred while creating a new user.', ['exception' => $e, 'email' => $email, 'class' => __CLASS__]);
+            
             throw new CreateNewUserException();
         }
         return $user;

49) /var/www/html/src/Account/Application/UserManagerService.php:113    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
                 $this->sendRegistrationConfirmationEmail($email);
             }
         } catch (\Throwable $e) {
-            $this->logger->error('An error occurred while creating a new user.', ['exception' => $e, 'email' => $email, 'class' => __CLASS__]);
+            $this->logger->error('An error occurred while creating a new user.', ['email' => $email, 'class' => __CLASS__]);
             throw new CreateNewUserException();
         }
         return $user;

50) /var/www/html/src/Account/Application/UserManagerService.php:120    [M] Throw_

--- Original
+++ New
@@ @@
             }
         } catch (\Throwable $e) {
             $this->logger->error('An error occurred while creating a new user.', ['exception' => $e, 'email' => $email, 'class' => __CLASS__]);
-            throw new CreateNewUserException();
+            new CreateNewUserException();
         }
         return $user;
     }

51) /var/www/html/src/Account/Application/UserManagerService.php:132    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
      */
     private function sendRegistrationConfirmationEmail(string $email): void
     {
-        $this->accountMailerService->sendEmailToUser($email, 'dashboard.authentication.registration.confirmation.title', 'dashboard/authentication/registration/confirmation-email-template.html.twig', [], 'An error occurred while sending registration confirmation email.');
+        
     }
 }

80) /var/www/html/src/Account/Domain/User.php:90    [M] Ternary

--- Original
+++ New
@@ @@
     private Collection $passwordTokens;
     public function __construct(Uuid $id = null)
     {
-        $this->id = $id ?: Uuid::v4();
+        $this->id = $id ? Uuid::v4() : $id;
         $this->passwordTokens = new ArrayCollection();
     }
     public function __toString(): string

81) /var/www/html/src/Account/Domain/User.php:104    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->id;
     }
-    public function setId(?Uuid $id): self
+    protected function setId(?Uuid $id): self
     {
         $this->id = $id;
         return $this;

82) /var/www/html/src/Account/Domain/User.php:116    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->email;
     }
-    public function setEmail(string $email): self
+    protected function setEmail(string $email): self
     {
         $this->email = $email;
         return $this;

83) /var/www/html/src/Account/Domain/User.php:144    [M] UnwrapArrayUnique

--- Original
+++ New
@@ @@
         $actualRoles = $this->roles;
         // guarantee every user at least has ROLE_USER
         $actualRoles[] = RoleEnum::USER->value;
-        return array_unique($actualRoles);
+        return $actualRoles;
     }
     /**
      * @param string[] $roles

84) /var/www/html/src/Account/Domain/User.php:150    [M] PublicVisibility

--- Original
+++ New
@@ @@
     /**
      * @param string[] $roles
      */
-    public function setRoles(array $roles): self
+    protected function setRoles(array $roles): self
     {
         $this->roles = $roles;
         return $this;

85) /var/www/html/src/Account/Domain/User.php:165    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->password;
     }
-    public function setPassword(?string $password): self
+    protected function setPassword(?string $password): self
     {
         $this->password = $password;
         return $this;

86) /var/www/html/src/Account/Domain/User.php:172    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $this->password = $password;
         return $this;
     }
-    public function getActualPassword(): ?string
+    protected function getActualPassword(): ?string
     {
         return $this->actualPassword;
     }

87) /var/www/html/src/Account/Domain/User.php:177    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->actualPassword;
     }
-    public function setActualPassword(string $actualPassword): self
+    protected function setActualPassword(string $actualPassword): self
     {
         $this->actualPassword = $actualPassword;
         return $this;

88) /var/www/html/src/Account/Domain/User.php:184    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $this->actualPassword = $actualPassword;
         return $this;
     }
-    public function setTotpSecret(TotpSecret $totpSecret): self
+    protected function setTotpSecret(TotpSecret $totpSecret): self
     {
         $this->totpSecret = $totpSecret;
         return $this;

89) /var/www/html/src/Account/Domain/User.php:193    [M] NullSafeMethodCall

--- Original
+++ New
@@ @@
     }
     public function isTotpAuthenticationEnabled(): bool
     {
-        return (bool) $this->totpSecret?->isEnable();
+        return (bool) $this->totpSecret->isEnable();
     }
     public function getTotpAuthenticationUsername(): string
     {

90) /var/www/html/src/Account/Domain/User.php:193    [M] CastBool

--- Original
+++ New
@@ @@
     }
     public function isTotpAuthenticationEnabled(): bool
     {
-        return (bool) $this->totpSecret?->isEnable();
+        return $this->totpSecret?->isEnable();
     }
     public function getTotpAuthenticationUsername(): string
     {

91) /var/www/html/src/Account/Domain/User.php:203    [M] NullSafeMethodCall

--- Original
+++ New
@@ @@
     }
     public function getTotpAuthenticationConfiguration(): ?TotpConfigurationInterface
     {
-        return new TotpConfiguration($this->totpSecret?->getSecret() ?? '', TotpConfiguration::ALGORITHM_SHA1, 30, 6);
+        return new TotpConfiguration($this->totpSecret->getSecret() ?? '', TotpConfiguration::ALGORITHM_SHA1, 30, 6);
     }
     /**
      * @see UserInterface

92) /var/www/html/src/Account/Domain/User.php:203    [M] Coalesce

--- Original
+++ New
@@ @@
     }
     public function getTotpAuthenticationConfiguration(): ?TotpConfigurationInterface
     {
-        return new TotpConfiguration($this->totpSecret?->getSecret() ?? '', TotpConfiguration::ALGORITHM_SHA1, 30, 6);
+        return new TotpConfiguration('' ?? $this->totpSecret?->getSecret(), TotpConfiguration::ALGORITHM_SHA1, 30, 6);
     }
     /**
      * @see UserInterface

93) /var/www/html/src/Account/Domain/User.php:203    [M] DecrementInteger

--- Original
+++ New
@@ @@
     }
     public function getTotpAuthenticationConfiguration(): ?TotpConfigurationInterface
     {
-        return new TotpConfiguration($this->totpSecret?->getSecret() ?? '', TotpConfiguration::ALGORITHM_SHA1, 30, 6);
+        return new TotpConfiguration($this->totpSecret?->getSecret() ?? '', TotpConfiguration::ALGORITHM_SHA1, 29, 6);
     }
     /**
      * @see UserInterface

94) /var/www/html/src/Account/Domain/User.php:203    [M] IncrementInteger

--- Original
+++ New
@@ @@
     }
     public function getTotpAuthenticationConfiguration(): ?TotpConfigurationInterface
     {
-        return new TotpConfiguration($this->totpSecret?->getSecret() ?? '', TotpConfiguration::ALGORITHM_SHA1, 30, 6);
+        return new TotpConfiguration($this->totpSecret?->getSecret() ?? '', TotpConfiguration::ALGORITHM_SHA1, 31, 6);
     }
     /**
      * @see UserInterface

95) /var/www/html/src/Account/Domain/User.php:203    [M] DecrementInteger

--- Original
+++ New
@@ @@
     }
     public function getTotpAuthenticationConfiguration(): ?TotpConfigurationInterface
     {
-        return new TotpConfiguration($this->totpSecret?->getSecret() ?? '', TotpConfiguration::ALGORITHM_SHA1, 30, 6);
+        return new TotpConfiguration($this->totpSecret?->getSecret() ?? '', TotpConfiguration::ALGORITHM_SHA1, 30, 5);
     }
     /**
      * @see UserInterface

96) /var/www/html/src/Account/Domain/User.php:203    [M] IncrementInteger

--- Original
+++ New
@@ @@
     }
     public function getTotpAuthenticationConfiguration(): ?TotpConfigurationInterface
     {
-        return new TotpConfiguration($this->totpSecret?->getSecret() ?? '', TotpConfiguration::ALGORITHM_SHA1, 30, 6);
+        return new TotpConfiguration($this->totpSecret?->getSecret() ?? '', TotpConfiguration::ALGORITHM_SHA1, 30, 7);
     }
     /**
      * @see UserInterface

97) /var/www/html/src/Account/Domain/User.php:203    [M] NewObject

--- Original
+++ New
@@ @@
     }
     public function getTotpAuthenticationConfiguration(): ?TotpConfigurationInterface
     {
-        return new TotpConfiguration($this->totpSecret?->getSecret() ?? '', TotpConfiguration::ALGORITHM_SHA1, 30, 6);
+        new TotpConfiguration($this->totpSecret?->getSecret() ?? '', TotpConfiguration::ALGORITHM_SHA1, 30, 6);
+        return null;
     }
     /**
      * @see UserInterface

98) /var/www/html/src/Account/Domain/User.php:228    [M] PublicVisibility

--- Original
+++ New
@@ @@
             $this->updatedAt = new \DateTimeImmutable();
         }
     }
-    public function getAvatarFile(): ?File
+    protected function getAvatarFile(): ?File
     {
         return $this->avatarFile;
     }

99) /var/www/html/src/Account/Domain/User.php:233    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->avatarFile;
     }
-    public function setAvatar(?string $avatar): void
+    protected function setAvatar(?string $avatar): void
     {
         $this->avatar = $avatar;
     }

100) /var/www/html/src/Account/Domain/User.php:238    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         $this->avatar = $avatar;
     }
-    public function getAvatar(): ?string
+    protected function getAvatar(): ?string
     {
         return $this->avatar;
     }

101) /var/www/html/src/Account/Domain/User.php:243    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->avatar;
     }
-    public function getAvatarUrl(): ?string
+    protected function getAvatarUrl(): ?string
     {
         if (!$this->avatar) {
             return null;

102) /var/www/html/src/Account/Domain/User.php:245    [M] LogicalNot

--- Original
+++ New
@@ @@
     }
     public function getAvatarUrl(): ?string
     {
-        if (!$this->avatar) {
+        if ($this->avatar) {
             return null;
         }
         if (str_contains($this->avatar, '/')) {

103) /var/www/html/src/Account/Domain/User.php:249    [M] IfNegation

--- Original
+++ New
@@ @@
         if (!$this->avatar) {
             return null;
         }
-        if (str_contains($this->avatar, '/')) {
+        if (!str_contains($this->avatar, '/')) {
             return $this->avatar;
         }
         return sprintf('/uploads/images/avatars/%s', $this->avatar);

104) /var/www/html/src/Account/Domain/User.php:253    [M] FunctionCall

--- Original
+++ New
@@ @@
         if (str_contains($this->avatar, '/')) {
             return $this->avatar;
         }
-        return sprintf('/uploads/images/avatars/%s', $this->avatar);
+        sprintf('/uploads/images/avatars/%s', $this->avatar);
+        return null;
     }
     public function setAvatarSize(?int $avatarSize): void
     {

105) /var/www/html/src/Account/Domain/User.php:256    [M] PublicVisibility

--- Original
+++ New
@@ @@
         }
         return sprintf('/uploads/images/avatars/%s', $this->avatar);
     }
-    public function setAvatarSize(?int $avatarSize): void
+    protected function setAvatarSize(?int $avatarSize): void
     {
         $this->avatarSize = $avatarSize;
     }

106) /var/www/html/src/Account/Domain/User.php:261    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         $this->avatarSize = $avatarSize;
     }
-    public function getAvatarSize(): ?int
+    protected function getAvatarSize(): ?int
     {
         return $this->avatarSize;
     }

107) /var/www/html/src/Account/Domain/User.php:268    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     }
     public function __serialize(): array
     {
-        return ['id' => $this->id, 'email' => $this->getEmail(), 'password' => $this->password];
+        return ['email' => $this->getEmail(), 'password' => $this->password];
     }
     public function isSuperAdmin(): bool
     {

108) /var/www/html/src/Account/Domain/User.php:269    [M] ArrayItem

--- Original
+++ New
@@ @@
     }
     public function __serialize(): array
     {
-        return ['id' => $this->id, 'email' => $this->getEmail(), 'password' => $this->password];
+        return ['id' > $this->id, 'email' => $this->getEmail(), 'password' => $this->password];
     }
     public function isSuperAdmin(): bool
     {

109) /var/www/html/src/Account/Domain/User.php:270    [M] ArrayItem

--- Original
+++ New
@@ @@
     }
     public function __serialize(): array
     {
-        return ['id' => $this->id, 'email' => $this->getEmail(), 'password' => $this->password];
+        return ['id' => $this->id, 'email' > $this->getEmail(), 'password' => $this->password];
     }
     public function isSuperAdmin(): bool
     {

110) /var/www/html/src/Account/Domain/User.php:271    [M] ArrayItem

--- Original
+++ New
@@ @@
     }
     public function __serialize(): array
     {
-        return ['id' => $this->id, 'email' => $this->getEmail(), 'password' => $this->password];
+        return ['id' => $this->id, 'email' => $this->getEmail(), 'password' > $this->password];
     }
     public function isSuperAdmin(): bool
     {

111) /var/www/html/src/Account/Domain/User.php:280    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return in_array(RoleEnum::SUPER_ADMIN->value, $this->roles, true);
     }
-    public function isAdmin(): bool
+    protected function isAdmin(): bool
     {
         return in_array(RoleEnum::ADMIN->value, $this->roles, true);
     }

112) /var/www/html/src/Account/Domain/User.php:285    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return in_array(RoleEnum::ADMIN->value, $this->roles, true);
     }
-    public function isVerified(): bool
+    protected function isVerified(): bool
     {
         return $this->isVerified;
     }

113) /var/www/html/src/Account/Domain/User.php:290    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->isVerified;
     }
-    public function setVerified(bool $isVerified): static
+    protected function setVerified(bool $isVerified): static
     {
         $this->isVerified = $isVerified;
         return $this;

114) /var/www/html/src/Account/Domain/User.php:297    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $this->isVerified = $isVerified;
         return $this;
     }
-    public function setAsAdmin(): void
+    protected function setAsAdmin(): void
     {
         $this->roles[] = RoleEnum::ADMIN->value;
     }

115) /var/www/html/src/Account/Domain/User.php:302    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         $this->roles[] = RoleEnum::ADMIN->value;
     }
-    public function addPasswordToken(PasswordToken $passwordToken): self
+    protected function addPasswordToken(PasswordToken $passwordToken): self
     {
         if (!$this->passwordTokens->contains($passwordToken)) {
             $this->passwordTokens[] = $passwordToken;

116) /var/www/html/src/Account/Domain/User.php:304    [M] LogicalNot

--- Original
+++ New
@@ @@
     }
     public function addPasswordToken(PasswordToken $passwordToken): self
     {
-        if (!$this->passwordTokens->contains($passwordToken)) {
+        if ($this->passwordTokens->contains($passwordToken)) {
             $this->passwordTokens[] = $passwordToken;
             $passwordToken->setUser($this);
         }

117) /var/www/html/src/Account/Domain/User.php:306    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         if (!$this->passwordTokens->contains($passwordToken)) {
             $this->passwordTokens[] = $passwordToken;
-            $passwordToken->setUser($this);
+            
         }
         return $this;
     }
