12) /var/www/html/src/Account/Application/PasswordTokenService.php:25    [M] PublicVisibility

--- Original
+++ New
@@ @@
     /**
      * @throws TokenGeneratingFailedException
      */
-    public function generateForOneDay(User $user): PasswordToken
+    protected function generateForOneDay(User $user): PasswordToken
     {
         try {
             $passwordToken = PasswordToken::generateForOneDay($user);

13) /var/www/html/src/Account/Application/PasswordTokenService.php:29    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         try {
             $passwordToken = PasswordToken::generateForOneDay($user);
-            $this->passwordTokenRepository->save($passwordToken);
+            
             return $passwordToken;
         } catch (\Throwable $exception) {
             $this->logger->error('An error occurred while generating password token.', ['exception' => $exception, 'user' => $user, 'class' => __CLASS__]);

14) /var/www/html/src/Account/Application/PasswordTokenService.php:33    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             $this->passwordTokenRepository->save($passwordToken);
             return $passwordToken;
         } catch (\Throwable $exception) {
-            $this->logger->error('An error occurred while generating password token.', ['exception' => $exception, 'user' => $user, 'class' => __CLASS__]);
+            
             throw new TokenGeneratingFailedException();
         }
     }

15) /var/www/html/src/Account/Application/PasswordTokenService.php:35    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
             $this->passwordTokenRepository->save($passwordToken);
             return $passwordToken;
         } catch (\Throwable $exception) {
-            $this->logger->error('An error occurred while generating password token.', ['exception' => $exception, 'user' => $user, 'class' => __CLASS__]);
+            $this->logger->error('An error occurred while generating password token.', ['user' => $user, 'class' => __CLASS__]);
             throw new TokenGeneratingFailedException();
         }
     }

16) /var/www/html/src/Account/Application/PasswordTokenService.php:41    [M] Throw_

--- Original
+++ New
@@ @@
             return $passwordToken;
         } catch (\Throwable $exception) {
             $this->logger->error('An error occurred while generating password token.', ['exception' => $exception, 'user' => $user, 'class' => __CLASS__]);
-            throw new TokenGeneratingFailedException();
+            new TokenGeneratingFailedException();
         }
     }
     /**

17) /var/www/html/src/Account/Application/PasswordTokenService.php:48    [M] PublicVisibility

--- Original
+++ New
@@ @@
     /**
      * @throws TokenNotFoundException
      */
-    public function setAsVerified(string $token): PasswordToken
+    protected function setAsVerified(string $token): PasswordToken
     {
         try {
             $passwordToken = $this->passwordTokenRepository->getByToken($token, new \DateTimeImmutable('now'));

26) /var/www/html/src/Account/Application/ResetPasswordService.php:30    [M] PublicVisibility

--- Original
+++ New
@@ @@
      * @throws RandomException
      * @throws TokenGeneratingFailedException
      */
-    public function sendResetPasswordEmail(string $email): void
+    protected function sendResetPasswordEmail(string $email): void
     {
         $user = $this->userRepository->getByEmail($email);
         if (null !== $user) {

27) /var/www/html/src/Account/Application/ResetPasswordService.php:34    [M] NotIdentical

--- Original
+++ New
@@ @@
     public function sendResetPasswordEmail(string $email): void
     {
         $user = $this->userRepository->getByEmail($email);
-        if (null !== $user) {
+        if (null === $user) {
             $passwordToken = $this->passwordTokenService->generateForOneDay($user);
         }

31) /var/www/html/src/Account/Application/ResetPasswordService.php:55    [M] PublicVisibility

--- Original
+++ New
@@ @@
      * @throws UserNotFoundException
      * @throws TokenNotFoundException
      */
-    public function resetPassword(string $token, string $email, string $password): void
+    protected function resetPassword(string $token, string $email, string $password): void
     {
         $user = $this->userRepository->getByEmail($email);
         if (null === $user) {

32) /var/www/html/src/Account/Application/ResetPasswordService.php:59    [M] Identical

--- Original
+++ New
@@ @@
     public function resetPassword(string $token, string $email, string $password): void
     {
         $user = $this->userRepository->getByEmail($email);
-        if (null === $user) {
+        if (null !== $user) {
             throw new UserNotFoundException();
         }
         if ($user->isTokenValid($token)) {

33) /var/www/html/src/Account/Application/ResetPasswordService.php:60    [M] Throw_

--- Original
+++ New
@@ @@
     {
         $user = $this->userRepository->getByEmail($email);
         if (null === $user) {
-            throw new UserNotFoundException();
+            new UserNotFoundException();
         }
         if ($user->isTokenValid($token)) {
             throw new TokenNotFoundException();

34) /var/www/html/src/Account/Application/ResetPasswordService.php:63    [M] IfNegation

--- Original
+++ New
@@ @@
         if (null === $user) {
             throw new UserNotFoundException();
         }
-        if ($user->isTokenValid($token)) {
+        if (!$user->isTokenValid($token)) {
             throw new TokenNotFoundException();
         }
         try {

35) /var/www/html/src/Account/Application/ResetPasswordService.php:64    [M] Throw_

--- Original
+++ New
@@ @@
             throw new UserNotFoundException();
         }
         if ($user->isTokenValid($token)) {
-            throw new TokenNotFoundException();
+            new TokenNotFoundException();
         }
         try {
             $this->userManager->updatePassword($user, $password);

36) /var/www/html/src/Account/Application/ResetPasswordService.php:68    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             throw new TokenNotFoundException();
         }
         try {
-            $this->userManager->updatePassword($user, $password);
+            
         } catch (\Throwable $exception) {
             $this->logger->error('An error occurred while resetting password.', ['exception' => $exception, 'email' => $email, 'class' => __CLASS__]);
             throw new ResetPasswordException();

37) /var/www/html/src/Account/Application/ResetPasswordService.php:70    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         try {
             $this->userManager->updatePassword($user, $password);
         } catch (\Throwable $exception) {
-            $this->logger->error('An error occurred while resetting password.', ['exception' => $exception, 'email' => $email, 'class' => __CLASS__]);
+            
             throw new ResetPasswordException();
         }
     }
 }

38) /var/www/html/src/Account/Application/ResetPasswordService.php:72    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         try {
             $this->userManager->updatePassword($user, $password);
         } catch (\Throwable $exception) {
-            $this->logger->error('An error occurred while resetting password.', ['exception' => $exception, 'email' => $email, 'class' => __CLASS__]);
+            $this->logger->error('An error occurred while resetting password.', ['email' => $email, 'class' => __CLASS__]);
             throw new ResetPasswordException();
         }
     }
 }

39) /var/www/html/src/Account/Application/ResetPasswordService.php:78    [M] Throw_

--- Original
+++ New
@@ @@
             $this->userManager->updatePassword($user, $password);
         } catch (\Throwable $exception) {
             $this->logger->error('An error occurred while resetting password.', ['exception' => $exception, 'email' => $email, 'class' => __CLASS__]);
-            throw new ResetPasswordException();
+            new ResetPasswordException();
         }
     }
 }

52) /var/www/html/src/Account/Domain/PasswordToken.php:47    [M] Coalesce

--- Original
+++ New
@@ @@
     public function __construct(User $user, ?Uuid $id = null, ?string $token = null, ?\DateTimeImmutable $expiredAt = null, ?\DateTimeImmutable $activatedAt = null, ?string $updatedBy = null)
     {
         $this->user = $user;
-        $this->id = $id ?? Uuid::v4();
+        $this->id = Uuid::v4() ?? $id;
         $this->token = $token;
         $this->expiredAt = $expiredAt;
         $this->activatedAt = $activatedAt;

53) /var/www/html/src/Account/Domain/PasswordToken.php:54    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $this->activatedAt = $activatedAt;
         $this->updatedBy = $updatedBy;
     }
-    public function getId(): ?Uuid
+    protected function getId(): ?Uuid
     {
         return $this->id;
     }

54) /var/www/html/src/Account/Domain/PasswordToken.php:59    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->id;
     }
-    public function getUser(): User
+    protected function getUser(): User
     {
         return $this->user;
     }

55) /var/www/html/src/Account/Domain/PasswordToken.php:64    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->user;
     }
-    public function setUser(User $user): self
+    protected function setUser(User $user): self
     {
         $this->user = $user;
         return $this;

56) /var/www/html/src/Account/Domain/PasswordToken.php:71    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $this->user = $user;
         return $this;
     }
-    public function isActive(\DateTimeImmutable $now): bool
+    protected function isActive(\DateTimeImmutable $now): bool
     {
         return $this->activatedAt !== null && $this->expiredAtIsInThePast($now) === false;
     }

57) /var/www/html/src/Account/Domain/PasswordToken.php:74    [M] NotIdentical

--- Original
+++ New
@@ @@
     }
     public function isActive(\DateTimeImmutable $now): bool
     {
-        return $this->activatedAt !== null && $this->expiredAtIsInThePast($now) === false;
+        return $this->activatedAt === null && $this->expiredAtIsInThePast($now) === false;
     }
     public function expiredAtIsInThePast(\DateTimeImmutable $now): bool
     {

58) /var/www/html/src/Account/Domain/PasswordToken.php:74    [M] LogicalAnd

--- Original
+++ New
@@ @@
     }
     public function isActive(\DateTimeImmutable $now): bool
     {
-        return $this->activatedAt !== null && $this->expiredAtIsInThePast($now) === false;
+        return $this->activatedAt !== null || $this->expiredAtIsInThePast($now) === false;
     }
     public function expiredAtIsInThePast(\DateTimeImmutable $now): bool
     {

59) /var/www/html/src/Account/Domain/PasswordToken.php:74    [M] LogicalAndAllSubExprNegation

--- Original
+++ New
@@ @@
     }
     public function isActive(\DateTimeImmutable $now): bool
     {
-        return $this->activatedAt !== null && $this->expiredAtIsInThePast($now) === false;
+        return !($this->activatedAt !== null) && $this->expiredAtIsInThePast($now) === false;
     }
     public function expiredAtIsInThePast(\DateTimeImmutable $now): bool
     {

60) /var/www/html/src/Account/Domain/PasswordToken.php:74    [M] LogicalAndNegation

--- Original
+++ New
@@ @@
     }
     public function isActive(\DateTimeImmutable $now): bool
     {
-        return $this->activatedAt !== null && $this->expiredAtIsInThePast($now) === false;
+        return !($this->activatedAt !== null && $this->expiredAtIsInThePast($now) === false);
     }
     public function expiredAtIsInThePast(\DateTimeImmutable $now): bool
     {

61) /var/www/html/src/Account/Domain/PasswordToken.php:75    [M] FalseValue

--- Original
+++ New
@@ @@
     }
     public function isActive(\DateTimeImmutable $now): bool
     {
-        return $this->activatedAt !== null && $this->expiredAtIsInThePast($now) === false;
+        return $this->activatedAt !== null && $this->expiredAtIsInThePast($now) === true;
     }
     public function expiredAtIsInThePast(\DateTimeImmutable $now): bool
     {

62) /var/www/html/src/Account/Domain/PasswordToken.php:75    [M] Identical

--- Original
+++ New
@@ @@
     }
     public function isActive(\DateTimeImmutable $now): bool
     {
-        return $this->activatedAt !== null && $this->expiredAtIsInThePast($now) === false;
+        return $this->activatedAt !== null && $this->expiredAtIsInThePast($now) !== false;
     }
     public function expiredAtIsInThePast(\DateTimeImmutable $now): bool
     {

63) /var/www/html/src/Account/Domain/PasswordToken.php:78    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->activatedAt !== null && $this->expiredAtIsInThePast($now) === false;
     }
-    public function expiredAtIsInThePast(\DateTimeImmutable $now): bool
+    protected function expiredAtIsInThePast(\DateTimeImmutable $now): bool
     {
         return $this->expiredAt !== null && $this->expiredAt < $now;
     }

64) /var/www/html/src/Account/Domain/PasswordToken.php:80    [M] NotIdentical

--- Original
+++ New
@@ @@
     }
     public function expiredAtIsInThePast(\DateTimeImmutable $now): bool
     {
-        return $this->expiredAt !== null && $this->expiredAt < $now;
+        return $this->expiredAt === null && $this->expiredAt < $now;
     }
     /**
      * @throws RandomException

65) /var/www/html/src/Account/Domain/PasswordToken.php:80    [M] LessThan

--- Original
+++ New
@@ @@
     }
     public function expiredAtIsInThePast(\DateTimeImmutable $now): bool
     {
-        return $this->expiredAt !== null && $this->expiredAt < $now;
+        return $this->expiredAt !== null && $this->expiredAt <= $now;
     }
     /**
      * @throws RandomException

66) /var/www/html/src/Account/Domain/PasswordToken.php:80    [M] LessThanNegotiation

--- Original
+++ New
@@ @@
     }
     public function expiredAtIsInThePast(\DateTimeImmutable $now): bool
     {
-        return $this->expiredAt !== null && $this->expiredAt < $now;
+        return $this->expiredAt !== null && $this->expiredAt >= $now;
     }
     /**
      * @throws RandomException

67) /var/www/html/src/Account/Domain/PasswordToken.php:80    [M] LogicalAnd

--- Original
+++ New
@@ @@
     }
     public function expiredAtIsInThePast(\DateTimeImmutable $now): bool
     {
-        return $this->expiredAt !== null && $this->expiredAt < $now;
+        return $this->expiredAt !== null || $this->expiredAt < $now;
     }
     /**
      * @throws RandomException

68) /var/www/html/src/Account/Domain/PasswordToken.php:80    [M] LogicalAndAllSubExprNegation

--- Original
+++ New
@@ @@
     }
     public function expiredAtIsInThePast(\DateTimeImmutable $now): bool
     {
-        return $this->expiredAt !== null && $this->expiredAt < $now;
+        return !($this->expiredAt !== null) && !($this->expiredAt < $now);
     }
     /**
      * @throws RandomException

69) /var/www/html/src/Account/Domain/PasswordToken.php:80    [M] LogicalAndNegation

--- Original
+++ New
@@ @@
     }
     public function expiredAtIsInThePast(\DateTimeImmutable $now): bool
     {
-        return $this->expiredAt !== null && $this->expiredAt < $now;
+        return !($this->expiredAt !== null && $this->expiredAt < $now);
     }
     /**
      * @throws RandomException

70) /var/www/html/src/Account/Domain/PasswordToken.php:86    [M] PublicVisibility

--- Original
+++ New
@@ @@
     /**
      * @throws RandomException
      */
-    public static function generateForMonth(User $user): self
+    protected static function generateForMonth(User $user): self
     {
         return PasswordToken::generateForDate($user, '+1 month');
     }

71) /var/www/html/src/Account/Domain/PasswordToken.php:94    [M] PublicVisibility

--- Original
+++ New
@@ @@
     /**
      * @throws RandomException
      */
-    public static function generateForOneDay(User $user): self
+    protected static function generateForOneDay(User $user): self
     {
         return PasswordToken::generateForDate($user, '+1 day');
     }

72) /var/www/html/src/Account/Domain/PasswordToken.php:103    [M] PublicVisibility

--- Original
+++ New
@@ @@
      * @throws RandomException
      * @throws \Exception
      */
-    public static function generateForDate(User $user, string $date): self
+    protected static function generateForDate(User $user, string $date): self
     {
         $token = bin2hex(random_bytes(32));
         $expiredAt = new \DateTimeImmutable($date);

73) /var/www/html/src/Account/Domain/PasswordToken.php:105    [M] DecrementInteger

--- Original
+++ New
@@ @@
      */
     public static function generateForDate(User $user, string $date): self
     {
-        $token = bin2hex(random_bytes(32));
+        $token = bin2hex(random_bytes(31));
         $expiredAt = new \DateTimeImmutable($date);
         return new self($user, token: $token, expiredAt: $expiredAt);
     }

74) /var/www/html/src/Account/Domain/PasswordToken.php:105    [M] IncrementInteger

--- Original
+++ New
@@ @@
      */
     public static function generateForDate(User $user, string $date): self
     {
-        $token = bin2hex(random_bytes(32));
+        $token = bin2hex(random_bytes(33));
         $expiredAt = new \DateTimeImmutable($date);
         return new self($user, token: $token, expiredAt: $expiredAt);
     }

75) /var/www/html/src/Account/Domain/PasswordToken.php:111    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $expiredAt = new \DateTimeImmutable($date);
         return new self($user, token: $token, expiredAt: $expiredAt);
     }
-    public function getToken(): ?string
+    protected function getToken(): ?string
     {
         return $this->token;
     }

76) /var/www/html/src/Account/Domain/PasswordToken.php:116    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->token;
     }
-    public function setAsVerified(string $activatedBy = 'system'): self
+    protected function setAsVerified(string $activatedBy = 'system'): self
     {
         $this->activatedAt = new \DateTimeImmutable('now');
         $this->updatedBy = $activatedBy;

77) /var/www/html/src/Account/Domain/PasswordToken.php:120    [M] TrueValue

--- Original
+++ New
@@ @@
     {
         $this->activatedAt = new \DateTimeImmutable('now');
         $this->updatedBy = $activatedBy;
-        $this->user->setVerified(true);
+        $this->user->setVerified(false);
         return $this;
     }
     public function getUpdatedBy(): ?string

78) /var/www/html/src/Account/Domain/PasswordToken.php:120    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         $this->activatedAt = new \DateTimeImmutable('now');
         $this->updatedBy = $activatedBy;
-        $this->user->setVerified(true);
+        
         return $this;
     }
     public function getUpdatedBy(): ?string

142) /var/www/html/src/Account/Infrastructure/Rest/PasswordTokenRepository.php:22    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
 {
     public function __construct(ManagerRegistry $registry)
     {
-        parent::__construct($registry, PasswordToken::class);
+        
     }
     public function getByToken(string $token, \DateTimeImmutable $now): ?PasswordToken
     {

143) /var/www/html/src/Account/Infrastructure/Rest/PasswordTokenRepository.php:41    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     }
     public function save(PasswordToken $passwordToken): void
     {
-        $this->getEntityManager()->persist($passwordToken);
+        
         $this->getEntityManager()->flush();
     }
 }

144) /var/www/html/src/Account/Infrastructure/Rest/PasswordTokenRepository.php:42    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public function save(PasswordToken $passwordToken): void
     {
         $this->getEntityManager()->persist($passwordToken);
-        $this->getEntityManager()->flush();
+        
     }
 }

168) /var/www/html/src/Account/Ui/Authentication/AccountAuthenticator.php:30    [M] Identical

--- Original
+++ New
@@ @@
     }
     public function supports(Request $request): bool
     {
-        return $request->isMethod('POST') && $this->getLoginUrl($request) === $request->getPathInfo();
+        return $request->isMethod('POST') && $this->getLoginUrl($request) !== $request->getPathInfo();
     }
     public function authenticate(Request $request): Passport
     {

169) /var/www/html/src/Account/Ui/Authentication/AccountAuthenticator.php:30    [M] LogicalAnd

--- Original
+++ New
@@ @@
     }
     public function supports(Request $request): bool
     {
-        return $request->isMethod('POST') && $this->getLoginUrl($request) === $request->getPathInfo();
+        return $request->isMethod('POST') || $this->getLoginUrl($request) === $request->getPathInfo();
     }
     public function authenticate(Request $request): Passport
     {

170) /var/www/html/src/Account/Ui/Authentication/AccountAuthenticator.php:30    [M] LogicalAndAllSubExprNegation

--- Original
+++ New
@@ @@
     }
     public function supports(Request $request): bool
     {
-        return $request->isMethod('POST') && $this->getLoginUrl($request) === $request->getPathInfo();
+        return !$request->isMethod('POST') && !($this->getLoginUrl($request) === $request->getPathInfo());
     }
     public function authenticate(Request $request): Passport
     {

171) /var/www/html/src/Account/Ui/Authentication/AccountAuthenticator.php:30    [M] LogicalAndNegation

--- Original
+++ New
@@ @@
     }
     public function supports(Request $request): bool
     {
-        return $request->isMethod('POST') && $this->getLoginUrl($request) === $request->getPathInfo();
+        return !($request->isMethod('POST') && $this->getLoginUrl($request) === $request->getPathInfo());
     }
     public function authenticate(Request $request): Passport
     {

172) /var/www/html/src/Account/Ui/Authentication/AccountAuthenticator.php:30    [M] LogicalAndSingleSubExprNegation

--- Original
+++ New
@@ @@
     }
     public function supports(Request $request): bool
     {
-        return $request->isMethod('POST') && $this->getLoginUrl($request) === $request->getPathInfo();
+        return !$request->isMethod('POST') && $this->getLoginUrl($request) === $request->getPathInfo();
     }
     public function authenticate(Request $request): Passport
     {

173) /var/www/html/src/Account/Ui/Authentication/AccountAuthenticator.php:39    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $loginFormData = $request->request->all('login_form');
         $email = $loginFormData['email'] ?? null;
         $password = $loginFormData['password'] ?? null;
-        $request->getSession()->set(SecurityRequestAttributes::LAST_USERNAME, $email);
+        
         return new Passport(new UserBadge($email), new PasswordCredentials($password), [new CsrfTokenBadge('authenticate', (string) $request->request->get('_csrf_token')), new RememberMeBadge()]);
     }
     public function onAuthenticationSuccess(Request $request, TokenInterface $token, string $firewallName): ?Response

174) /var/www/html/src/Account/Ui/Authentication/AccountAuthenticator.php:44    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         $email = $loginFormData['email'] ?? null;
         $password = $loginFormData['password'] ?? null;
         $request->getSession()->set(SecurityRequestAttributes::LAST_USERNAME, $email);
-        return new Passport(new UserBadge($email), new PasswordCredentials($password), [new CsrfTokenBadge('authenticate', (string) $request->request->get('_csrf_token')), new RememberMeBadge()]);
+        return new Passport(new UserBadge($email), new PasswordCredentials($password), [new RememberMeBadge()]);
     }
     public function onAuthenticationSuccess(Request $request, TokenInterface $token, string $firewallName): ?Response
     {

175) /var/www/html/src/Account/Ui/Authentication/AccountAuthenticator.php:45    [M] CastString

--- Original
+++ New
@@ @@
         $email = $loginFormData['email'] ?? null;
         $password = $loginFormData['password'] ?? null;
         $request->getSession()->set(SecurityRequestAttributes::LAST_USERNAME, $email);
-        return new Passport(new UserBadge($email), new PasswordCredentials($password), [new CsrfTokenBadge('authenticate', (string) $request->request->get('_csrf_token')), new RememberMeBadge()]);
+        return new Passport(new UserBadge($email), new PasswordCredentials($password), [new CsrfTokenBadge('authenticate', $request->request->get('_csrf_token')), new RememberMeBadge()]);
     }
     public function onAuthenticationSuccess(Request $request, TokenInterface $token, string $firewallName): ?Response
     {

176) /var/www/html/src/Account/Ui/Authentication/AccountAuthenticator.php:54    [M] NewObject

--- Original
+++ New
@@ @@
     public function onAuthenticationSuccess(Request $request, TokenInterface $token, string $firewallName): ?Response
     {
         if ($targetPath = $this->getTargetPath($request->getSession(), $firewallName)) {
-            return new RedirectResponse($targetPath);
+            new RedirectResponse($targetPath);
+            return null;
         }
         return new RedirectResponse($this->getPanelDashboardUrl());
     }

177) /var/www/html/src/Account/Ui/Authentication/AccountAuthenticator.php:57    [M] NewObject

--- Original
+++ New
@@ @@
         if ($targetPath = $this->getTargetPath($request->getSession(), $firewallName)) {
             return new RedirectResponse($targetPath);
         }
-        return new RedirectResponse($this->getPanelDashboardUrl());
+        new RedirectResponse($this->getPanelDashboardUrl());
+        return null;
     }
     protected function getLoginUrl(Request $request): string
     {

178) /var/www/html/src/Account/Ui/Authentication/Login/LoginController.php:13    [M] PublicVisibility

--- Original
+++ New
@@ @@
 class LoginController extends AbstractBaseController
 {
     #[Route(path: '/dashboard/login', name: 'app_login')]
-    public function login(AuthenticationUtils $authenticationUtils): Response
+    protected function login(AuthenticationUtils $authenticationUtils): Response
     {
         $user = $this->getUser();
         if ($user && false === $user->isVerified()) {

179) /var/www/html/src/Account/Ui/Authentication/Login/LoginController.php:18    [M] FalseValue

--- Original
+++ New
@@ @@
     public function login(AuthenticationUtils $authenticationUtils): Response
     {
         $user = $this->getUser();
-        if ($user && false === $user->isVerified()) {
+        if ($user && true === $user->isVerified()) {
             $this->addFlash('warning', 'dashboard.authentication.login.verifyEmail');
         }
         if ($user && $user->isAdmin() && $user->isVerified()) {

180) /var/www/html/src/Account/Ui/Authentication/Login/LoginController.php:18    [M] Identical

--- Original
+++ New
@@ @@
     public function login(AuthenticationUtils $authenticationUtils): Response
     {
         $user = $this->getUser();
-        if ($user && false === $user->isVerified()) {
+        if ($user && false !== $user->isVerified()) {
             $this->addFlash('warning', 'dashboard.authentication.login.verifyEmail');
         }
         if ($user && $user->isAdmin() && $user->isVerified()) {

181) /var/www/html/src/Account/Ui/Authentication/Login/LoginController.php:18    [M] LogicalAnd

--- Original
+++ New
@@ @@
     public function login(AuthenticationUtils $authenticationUtils): Response
     {
         $user = $this->getUser();
-        if ($user && false === $user->isVerified()) {
+        if ($user || false === $user->isVerified()) {
             $this->addFlash('warning', 'dashboard.authentication.login.verifyEmail');
         }
         if ($user && $user->isAdmin() && $user->isVerified()) {

182) /var/www/html/src/Account/Ui/Authentication/Login/LoginController.php:18    [M] LogicalAndAllSubExprNegation

--- Original
+++ New
@@ @@
     public function login(AuthenticationUtils $authenticationUtils): Response
     {
         $user = $this->getUser();
-        if ($user && false === $user->isVerified()) {
+        if (!$user && false === $user->isVerified()) {
             $this->addFlash('warning', 'dashboard.authentication.login.verifyEmail');
         }
         if ($user && $user->isAdmin() && $user->isVerified()) {

183) /var/www/html/src/Account/Ui/Authentication/Login/LoginController.php:18    [M] LogicalAndNegation

--- Original
+++ New
@@ @@
     public function login(AuthenticationUtils $authenticationUtils): Response
     {
         $user = $this->getUser();
-        if ($user && false === $user->isVerified()) {
+        if (!($user && false === $user->isVerified())) {
             $this->addFlash('warning', 'dashboard.authentication.login.verifyEmail');
         }
         if ($user && $user->isAdmin() && $user->isVerified()) {

185) /var/www/html/src/Account/Ui/Authentication/Login/LoginController.php:19    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         $user = $this->getUser();
         if ($user && false === $user->isVerified()) {
-            $this->addFlash('warning', 'dashboard.authentication.login.verifyEmail');
+            
         }
         if ($user && $user->isAdmin() && $user->isVerified()) {
             return $this->redirectToRoute(AccountAuthenticatorService::DASHBOARD_ROUTE);
