118) /var/www/html/src/Account/Domain/User.php:315    [M] PublicVisibility

--- Original
+++ New
@@ @@
     /**
      * @return Collection<int, PasswordToken>
      */
-    public function getPasswordTokens(): Collection
+    protected function getPasswordTokens(): Collection
     {
         return $this->passwordTokens;
     }

119) /var/www/html/src/Account/Domain/User.php:320    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->passwordTokens;
     }
-    public function getActiveToken(\DateTimeImmutable $now): ?PasswordToken
+    protected function getActiveToken(\DateTimeImmutable $now): ?PasswordToken
     {
         foreach ($this->passwordTokens as $passwordToken) {
             if ($passwordToken->isActive($now)) {

120) /var/www/html/src/Account/Domain/User.php:322    [M] Foreach_

--- Original
+++ New
@@ @@
     }
     public function getActiveToken(\DateTimeImmutable $now): ?PasswordToken
     {
-        foreach ($this->passwordTokens as $passwordToken) {
+        foreach ([] as $passwordToken) {
             if ($passwordToken->isActive($now)) {
                 return $passwordToken;
             }

121) /var/www/html/src/Account/Domain/User.php:323    [M] IfNegation

--- Original
+++ New
@@ @@
     public function getActiveToken(\DateTimeImmutable $now): ?PasswordToken
     {
         foreach ($this->passwordTokens as $passwordToken) {
-            if ($passwordToken->isActive($now)) {
+            if (!$passwordToken->isActive($now)) {
                 return $passwordToken;
             }
         }

122) /var/www/html/src/Account/Domain/User.php:331    [M] PublicVisibility

--- Original
+++ New
@@ @@
         }
         return null;
     }
-    public function addPasswordTokenForOneMonth(): void
+    protected function addPasswordTokenForOneMonth(): void
     {
         $this->addPasswordToken(PasswordToken::generateForMonth($this));
     }

123) /var/www/html/src/Account/Domain/User.php:333    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     }
     public function addPasswordTokenForOneMonth(): void
     {
-        $this->addPasswordToken(PasswordToken::generateForMonth($this));
+        
     }
     public function isActive(): bool
     {

124) /var/www/html/src/Account/Domain/User.php:336    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         $this->addPasswordToken(PasswordToken::generateForMonth($this));
     }
-    public function isActive(): bool
+    protected function isActive(): bool
     {
         return $this->isVerified;
     }

125) /var/www/html/src/Account/Domain/User.php:341    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->isVerified;
     }
-    public function isTokenValid(string $token): bool
+    protected function isTokenValid(string $token): bool
     {
         foreach ($this->passwordTokens as $passwordToken) {
             if ($passwordToken->getToken() === $token && $passwordToken->isActive(new \DateTimeImmutable())) {

127) /var/www/html/src/Account/Domain/User.php:344    [M] Identical

--- Original
+++ New
@@ @@
     public function isTokenValid(string $token): bool
     {
         foreach ($this->passwordTokens as $passwordToken) {
-            if ($passwordToken->getToken() === $token && $passwordToken->isActive(new \DateTimeImmutable())) {
+            if ($passwordToken->getToken() !== $token && $passwordToken->isActive(new \DateTimeImmutable())) {
                 return true;
             }
         }

128) /var/www/html/src/Account/Domain/User.php:344    [M] LogicalAnd

--- Original
+++ New
@@ @@
     public function isTokenValid(string $token): bool
     {
         foreach ($this->passwordTokens as $passwordToken) {
-            if ($passwordToken->getToken() === $token && $passwordToken->isActive(new \DateTimeImmutable())) {
+            if ($passwordToken->getToken() === $token || $passwordToken->isActive(new \DateTimeImmutable())) {
                 return true;
             }
         }

129) /var/www/html/src/Account/Domain/User.php:344    [M] LogicalAndAllSubExprNegation

--- Original
+++ New
@@ @@
     public function isTokenValid(string $token): bool
     {
         foreach ($this->passwordTokens as $passwordToken) {
-            if ($passwordToken->getToken() === $token && $passwordToken->isActive(new \DateTimeImmutable())) {
+            if (!($passwordToken->getToken() === $token) && !$passwordToken->isActive(new \DateTimeImmutable())) {
                 return true;
             }
         }

130) /var/www/html/src/Account/Domain/User.php:344    [M] LogicalAndNegation

--- Original
+++ New
@@ @@
     public function isTokenValid(string $token): bool
     {
         foreach ($this->passwordTokens as $passwordToken) {
-            if ($passwordToken->getToken() === $token && $passwordToken->isActive(new \DateTimeImmutable())) {
+            if (!($passwordToken->getToken() === $token && $passwordToken->isActive(new \DateTimeImmutable()))) {
                 return true;
             }
         }

131) /var/www/html/src/Account/Domain/User.php:344    [M] LogicalAndSingleSubExprNegation

--- Original
+++ New
@@ @@
     public function isTokenValid(string $token): bool
     {
         foreach ($this->passwordTokens as $passwordToken) {
-            if ($passwordToken->getToken() === $token && $passwordToken->isActive(new \DateTimeImmutable())) {
+            if ($passwordToken->getToken() === $token && !$passwordToken->isActive(new \DateTimeImmutable())) {
                 return true;
             }
         }

132) /var/www/html/src/Account/Domain/User.php:347    [M] TrueValue

--- Original
+++ New
@@ @@
     {
         foreach ($this->passwordTokens as $passwordToken) {
             if ($passwordToken->getToken() === $token && $passwordToken->isActive(new \DateTimeImmutable())) {
-                return true;
+                return false;
             }
         }
         return false;
     }
 }

134) /var/www/html/src/Account/Domain/UserFactory.php:14    [M] PublicVisibility

--- Original
+++ New
@@ @@
     public function __construct(private readonly UserPasswordHasherInterface $userPasswordHasher)
     {
     }
-    public function create(string $email, string $password): User
+    protected function create(string $email, string $password): User
     {
         $user = new User();
         $user->setEmail($email);

135) /var/www/html/src/Account/Domain/UserFactory.php:17    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public function create(string $email, string $password): User
     {
         $user = new User();
-        $user->setEmail($email);
+        
         $hashedPassword = $this->userPasswordHasher->hashPassword($user, $password);
         $user->setPassword($hashedPassword);
         $user->addPasswordTokenForOneMonth();

136) /var/www/html/src/Account/Domain/UserFactory.php:22    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $user = new User();
         $user->setEmail($email);
         $hashedPassword = $this->userPasswordHasher->hashPassword($user, $password);
-        $user->setPassword($hashedPassword);
+        
         $user->addPasswordTokenForOneMonth();
         $user->setAsAdmin();
         return $user;
     }
 }

137) /var/www/html/src/Account/Domain/UserFactory.php:23    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $user->setEmail($email);
         $hashedPassword = $this->userPasswordHasher->hashPassword($user, $password);
         $user->setPassword($hashedPassword);
-        $user->addPasswordTokenForOneMonth();
+        
         $user->setAsAdmin();
         return $user;
     }
 }

138) /var/www/html/src/Account/Domain/UserFactory.php:24    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $hashedPassword = $this->userPasswordHasher->hashPassword($user, $password);
         $user->setPassword($hashedPassword);
         $user->addPasswordTokenForOneMonth();
-        $user->setAsAdmin();
+        
         return $user;
     }
 }

139) /var/www/html/src/Account/Domain/ValueObject/TotpSecret.php:19    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         $this->secret = $secret;
     }
-    public function isEnable(): bool
+    protected function isEnable(): bool
     {
         return null !== $this->secret;
     }

140) /var/www/html/src/Account/Domain/ValueObject/TotpSecret.php:21    [M] NotIdentical

--- Original
+++ New
@@ @@
     }
     public function isEnable(): bool
     {
-        return null !== $this->secret;
+        return null === $this->secret;
     }
     public function getSecret(): ?string
     {

141) /var/www/html/src/Account/Domain/ValueObject/TotpSecret.php:24    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return null !== $this->secret;
     }
-    public function getSecret(): ?string
+    protected function getSecret(): ?string
     {
         return $this->secret;
     }
 }

146) /var/www/html/src/Account/Infrastructure/Rest/UserRepository.php:29    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     }
     public function save(User $entity): void
     {
-        $this->getEntityManager()->persist($entity);
+        
         $this->getEntityManager()->flush();
     }
     /**

147) /var/www/html/src/Account/Infrastructure/Rest/UserRepository.php:30    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public function save(User $entity): void
     {
         $this->getEntityManager()->persist($entity);
-        $this->getEntityManager()->flush();
+        
     }
     /**
      * Used to upgrade (rehash) the user's password automatically over time.

148) /var/www/html/src/Account/Infrastructure/Rest/UserRepository.php:38    [M] InstanceOf_

--- Original
+++ New
@@ @@
      */
     public function upgradePassword(PasswordAuthenticatedUserInterface $user, string $newHashedPassword): void
     {
-        if (!$user instanceof User) {
+        if (!true) {
             throw new UnsupportedUserException(sprintf('Instances of "%s" are not supported.', \get_class($user)));
         }
         $user->setPassword($newHashedPassword);

149) /var/www/html/src/Account/Infrastructure/Rest/UserRepository.php:38    [M] InstanceOf_

--- Original
+++ New
@@ @@
      */
     public function upgradePassword(PasswordAuthenticatedUserInterface $user, string $newHashedPassword): void
     {
-        if (!$user instanceof User) {
+        if (!false) {
             throw new UnsupportedUserException(sprintf('Instances of "%s" are not supported.', \get_class($user)));
         }
         $user->setPassword($newHashedPassword);

150) /var/www/html/src/Account/Infrastructure/Rest/UserRepository.php:38    [M] LogicalNot

--- Original
+++ New
@@ @@
      */
     public function upgradePassword(PasswordAuthenticatedUserInterface $user, string $newHashedPassword): void
     {
-        if (!$user instanceof User) {
+        if ($user instanceof User) {
             throw new UnsupportedUserException(sprintf('Instances of "%s" are not supported.', \get_class($user)));
         }
         $user->setPassword($newHashedPassword);

151) /var/www/html/src/Account/Infrastructure/Rest/UserRepository.php:39    [M] Throw_

--- Original
+++ New
@@ @@
     public function upgradePassword(PasswordAuthenticatedUserInterface $user, string $newHashedPassword): void
     {
         if (!$user instanceof User) {
-            throw new UnsupportedUserException(sprintf('Instances of "%s" are not supported.', \get_class($user)));
+            new UnsupportedUserException(sprintf('Instances of "%s" are not supported.', \get_class($user)));
         }
         $user->setPassword($newHashedPassword);
         $user->setUpdatedAt(new \DateTimeImmutable());

152) /var/www/html/src/Account/Infrastructure/Rest/UserRepository.php:42    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         if (!$user instanceof User) {
             throw new UnsupportedUserException(sprintf('Instances of "%s" are not supported.', \get_class($user)));
         }
-        $user->setPassword($newHashedPassword);
+        
         $user->setUpdatedAt(new \DateTimeImmutable());
         $this->save($user);
     }

153) /var/www/html/src/Account/Infrastructure/Rest/UserRepository.php:43    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             throw new UnsupportedUserException(sprintf('Instances of "%s" are not supported.', \get_class($user)));
         }
         $user->setPassword($newHashedPassword);
-        $user->setUpdatedAt(new \DateTimeImmutable());
+        
         $this->save($user);
     }
     public function getByEmail(string $email): ?User

154) /var/www/html/src/Account/Infrastructure/Rest/UserRepository.php:45    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         }
         $user->setPassword($newHashedPassword);
         $user->setUpdatedAt(new \DateTimeImmutable());
-        $this->save($user);
+        
     }
     public function getByEmail(string $email): ?User
     {

155) /var/www/html/src/Account/Infrastructure/Rest/UserRepository.php:50    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     }
     public function getByEmail(string $email): ?User
     {
-        return $this->findOneBy(['email' => $email]);
+        return $this->findOneBy([]);
     }
 }

156) /var/www/html/src/Account/Ui/AccountController.php:41    [M] TrueValue

--- Original
+++ New
@@ @@
     public function configureActions(Actions $actions): Actions
     {
         /** @phpstan-ignore-next-line  */
-        $fa2Action = true === $this->getUser()?->isTotpAuthenticationEnabled() ? $this->createDisable2FaAction() : $this->createEnable2FaAction();
+        $fa2Action = false === $this->getUser()?->isTotpAuthenticationEnabled() ? $this->createDisable2FaAction() : $this->createEnable2FaAction();
         return parent::configureActions($actions)->remove(Crud::PAGE_EDIT, Action::SAVE_AND_RETURN)->add(Crud::PAGE_EDIT, $fa2Action);
     }
     public function configureFields(string $pageName): iterable

157) /var/www/html/src/Account/Ui/AccountController.php:41    [M] NullSafeMethodCall

--- Original
+++ New
@@ @@
     public function configureActions(Actions $actions): Actions
     {
         /** @phpstan-ignore-next-line  */
-        $fa2Action = true === $this->getUser()?->isTotpAuthenticationEnabled() ? $this->createDisable2FaAction() : $this->createEnable2FaAction();
+        $fa2Action = true === $this->getUser()->isTotpAuthenticationEnabled() ? $this->createDisable2FaAction() : $this->createEnable2FaAction();
         return parent::configureActions($actions)->remove(Crud::PAGE_EDIT, Action::SAVE_AND_RETURN)->add(Crud::PAGE_EDIT, $fa2Action);
     }
     public function configureFields(string $pageName): iterable

158) /var/www/html/src/Account/Ui/AccountController.php:41    [M] Identical

--- Original
+++ New
@@ @@
     public function configureActions(Actions $actions): Actions
     {
         /** @phpstan-ignore-next-line  */
-        $fa2Action = true === $this->getUser()?->isTotpAuthenticationEnabled() ? $this->createDisable2FaAction() : $this->createEnable2FaAction();
+        $fa2Action = true !== $this->getUser()?->isTotpAuthenticationEnabled() ? $this->createDisable2FaAction() : $this->createEnable2FaAction();
         return parent::configureActions($actions)->remove(Crud::PAGE_EDIT, Action::SAVE_AND_RETURN)->add(Crud::PAGE_EDIT, $fa2Action);
     }
     public function configureFields(string $pageName): iterable

159) /var/www/html/src/Account/Ui/AccountController.php:41    [M] Ternary

--- Original
+++ New
@@ @@
     public function configureActions(Actions $actions): Actions
     {
         /** @phpstan-ignore-next-line  */
-        $fa2Action = true === $this->getUser()?->isTotpAuthenticationEnabled() ? $this->createDisable2FaAction() : $this->createEnable2FaAction();
+        $fa2Action = true === $this->getUser()?->isTotpAuthenticationEnabled() ? $this->createEnable2FaAction() : $this->createDisable2FaAction();
         return parent::configureActions($actions)->remove(Crud::PAGE_EDIT, Action::SAVE_AND_RETURN)->add(Crud::PAGE_EDIT, $fa2Action);
     }
     public function configureFields(string $pageName): iterable

160) /var/www/html/src/Account/Ui/AccountController.php:55    [M] TrueValue

--- Original
+++ New
@@ @@
     {
         $user = $this->getUser();
         yield FormField::addFieldset('admin.account.block.baseData')->setCssClass('col-sm-6');
-        yield EmailField::new('email')->setRequired(true)->onlyOnForms();
+        yield EmailField::new('email')->setRequired(false)->onlyOnForms();
         yield VichImageField::new('avatarFile', 'admin.account.avatar')->setDownloadUri('public/uploads/images/avatars')->setImageUri(null)->setUploadedFileNamePattern(sprintf('%s-[slug]-[timestamp].[extension]', $user?->getId()));
         yield FormField::addFieldset('admin.account.block.changePassword')->setCssClass('col-sm-6');
         yield TextField::new('actualPassword')->setLabel('admin.account.actualPassword')->setFormType(PasswordType::class)->setRequired(false)->onlyOnForms();

161) /var/www/html/src/Account/Ui/AccountController.php:60    [M] NullSafeMethodCall

--- Original
+++ New
@@ @@
         $user = $this->getUser();
         yield FormField::addFieldset('admin.account.block.baseData')->setCssClass('col-sm-6');
         yield EmailField::new('email')->setRequired(true)->onlyOnForms();
-        yield VichImageField::new('avatarFile', 'admin.account.avatar')->setDownloadUri('public/uploads/images/avatars')->setImageUri(null)->setUploadedFileNamePattern(sprintf('%s-[slug]-[timestamp].[extension]', $user?->getId()));
+        yield VichImageField::new('avatarFile', 'admin.account.avatar')->setDownloadUri('public/uploads/images/avatars')->setImageUri(null)->setUploadedFileNamePattern(sprintf('%s-[slug]-[timestamp].[extension]', $user->getId()));
         yield FormField::addFieldset('admin.account.block.changePassword')->setCssClass('col-sm-6');
         yield TextField::new('actualPassword')->setLabel('admin.account.actualPassword')->setFormType(PasswordType::class)->setRequired(false)->onlyOnForms();

162) /var/www/html/src/Account/Ui/AccountController.php:66    [M] FalseValue

--- Original
+++ New
@@ @@
         yield EmailField::new('email')->setRequired(true)->onlyOnForms();
         yield VichImageField::new('avatarFile', 'admin.account.avatar')->setDownloadUri('public/uploads/images/avatars')->setImageUri(null)->setUploadedFileNamePattern(sprintf('%s-[slug]-[timestamp].[extension]', $user?->getId()));
         yield FormField::addFieldset('admin.account.block.changePassword')->setCssClass('col-sm-6');
-        yield TextField::new('actualPassword')->setLabel('admin.account.actualPassword')->setFormType(PasswordType::class)->setRequired(false)->onlyOnForms();
+        yield TextField::new('actualPassword')->setLabel('admin.account.actualPassword')->setFormType(PasswordType::class)->setRequired(true)->onlyOnForms();
     }
     public function configureCrud(Crud $crud): Crud

238) /var/www/html/src/Dashboard/Ui/DashboardController.php:42    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     public function index(): Response
     {
         $dashboardData = $this->getDashboardData();
-        return $this->render('dashboard/main/index.html.twig', ['dashboardData' => $dashboardData]);
+        return $this->render('dashboard/main/index.html.twig', []);
     }
     public function configureAssets(): Assets
     {

239) /var/www/html/src/Dashboard/Ui/DashboardController.php:59    [M] FalseValue

--- Original
+++ New
@@ @@
     }
     public function configureDashboard(): Dashboard
     {
-        return Dashboard::new()->setTitle('panel.dashboard.title')->setFaviconPath('/images/favicon.ico')->disableDarkMode(false);
+        return Dashboard::new()->setTitle('panel.dashboard.title')->setFaviconPath('/images/favicon.ico')->disableDarkMode(true);
         //            ->setLocales([
         //                'pl' => '🇵🇱 Polski',
         //                'en' => '🇬🇧 English',

240) /var/www/html/src/Dashboard/Ui/DashboardController.php:156    [M] Foreach_

--- Original
+++ New
@@ @@
     {
         $filePath = sprintf('%s/./Assets/menu-dashboard-items.yaml', __DIR__);
         $dashboardData = $this->yamlParser->getDataFromFile($filePath);
-        foreach ($dashboardData as $menuItem => $data) {
+        foreach ([] as $menuItem => $data) {
             $dashboardData[$menuItem]['url'] = $this->adminUrlGenerator->setController($data['controller'])->setAction(Action::INDEX)->generateUrl();
         }
         return $dashboardData;
     }
 }

241) /var/www/html/src/Dashboard/Ui/DashboardController.php:163    [M] ArrayOneItem

--- Original
+++ New
@@ @@
         foreach ($dashboardData as $menuItem => $data) {
             $dashboardData[$menuItem]['url'] = $this->adminUrlGenerator->setController($data['controller'])->setAction(Action::INDEX)->generateUrl();
         }
-        return $dashboardData;
+        return count($dashboardData) > 1 ? array_slice($dashboardData, 0, 1, true) : $dashboardData;
     }
 }

242) /var/www/html/src/Kernel/EventSubscriber/IdSubscriber.php:19    [M] PublicVisibility

--- Original
+++ New
@@ @@
     /**
      * @param LifecycleEventArgs<EntityManagerInterface> $args
      */
-    public function prePersist(LifecycleEventArgs $args): void
+    protected function prePersist(LifecycleEventArgs $args): void
     {
         $entity = $args->getObject();
         if (!$entity instanceof IdResourceInterface) {

243) /var/www/html/src/Kernel/EventSubscriber/IdSubscriber.php:23    [M] InstanceOf_

--- Original
+++ New
@@ @@
     public function prePersist(LifecycleEventArgs $args): void
     {
         $entity = $args->getObject();
-        if (!$entity instanceof IdResourceInterface) {
+        if (!true) {
             return;
         }
         if (null === $entity->getId()) {

244) /var/www/html/src/Kernel/EventSubscriber/IdSubscriber.php:23    [M] InstanceOf_

--- Original
+++ New
@@ @@
     public function prePersist(LifecycleEventArgs $args): void
     {
         $entity = $args->getObject();
-        if (!$entity instanceof IdResourceInterface) {
+        if (!false) {
             return;
         }
         if (null === $entity->getId()) {

245) /var/www/html/src/Kernel/EventSubscriber/IdSubscriber.php:23    [M] LogicalNot

--- Original
+++ New
@@ @@
     public function prePersist(LifecycleEventArgs $args): void
     {
         $entity = $args->getObject();
-        if (!$entity instanceof IdResourceInterface) {
+        if ($entity instanceof IdResourceInterface) {
             return;
         }
         if (null === $entity->getId()) {

246) /var/www/html/src/Kernel/EventSubscriber/IdSubscriber.php:27    [M] Identical

--- Original
+++ New
@@ @@
         if (!$entity instanceof IdResourceInterface) {
             return;
         }
-        if (null === $entity->getId()) {
+        if (null !== $entity->getId()) {
             $entity->setId(Uuid::v4());
         }
     }
 }

247) /var/www/html/src/Kernel/EventSubscriber/IdSubscriber.php:28    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             return;
         }
         if (null === $entity->getId()) {
-            $entity->setId(Uuid::v4());
+            
         }
     }
 }

248) /var/www/html/src/Kernel/MultiplyRolesExpression.php:15    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
      */
     public function __construct(...$roles)
     {
-        parent::__construct($this->generateRolesExpression(...$roles));
+        
     }
     /**
      * @param RoleEnum ...$roles

249) /var/www/html/src/Kernel/MultiplyRolesExpression.php:23    [M] UnwrapArrayMap

--- Original
+++ New
@@ @@
      */
     private function generateRolesExpression(...$roles): string
     {
-        $roles = array_map(static fn($role) => $role->value, $roles);
+        $roles = $roles;
         return implode(' or ', array_map(fn($role) => "is_granted(\"{$role}\")", $roles));
     }
 }

250) /var/www/html/src/Kernel/MultiplyRolesExpression.php:25    [M] UnwrapArrayMap

--- Original
+++ New
@@ @@
     private function generateRolesExpression(...$roles): string
     {
         $roles = array_map(static fn($role) => $role->value, $roles);
-        return implode(' or ', array_map(fn($role) => "is_granted(\"{$role}\")", $roles));
+        return implode(' or ', $roles);
     }
 }

251) /var/www/html/src/Kernel/Traits/CreatedTrait.php:15    [M] PublicVisibility

--- Original
+++ New
@@ @@
     private ?\DateTimeImmutable $createdAt = null;
     #[ORM\Column(type: 'string', length: 191, nullable: true)]
     private ?string $createdBy = null;
-    public function getCreatedAt(): ?\DateTimeImmutable
+    protected function getCreatedAt(): ?\DateTimeImmutable
     {
         return $this->createdAt;
     }

252) /var/www/html/src/Kernel/Traits/CreatedTrait.php:20    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->createdAt;
     }
-    public function setCreatedAt(?\DateTimeImmutable $createdAt): self
+    protected function setCreatedAt(?\DateTimeImmutable $createdAt): self
     {
         $this->createdAt = $createdAt;
         return $this;

253) /var/www/html/src/Kernel/Traits/CreatedTrait.php:28    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $this->createdAt = $createdAt;
         return $this;
     }
-    public function setCreatedBy(?string $createdBy): self
+    protected function setCreatedBy(?string $createdBy): self
     {
         $this->createdBy = $createdBy;
         return $this;

254) /var/www/html/src/Kernel/Traits/CreatedTrait.php:35    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $this->createdBy = $createdBy;
         return $this;
     }
-    public function getCreatedBy(): ?string
+    protected function getCreatedBy(): ?string
     {
         return $this->createdBy;
     }
 }

255) /var/www/html/src/Kernel/Traits/DeletedTrait.php:15    [M] PublicVisibility

--- Original
+++ New
@@ @@
     private ?\DateTimeImmutable $deletedAt = null;
     #[ORM\Column(type: 'string', length: 191, nullable: true)]
     private ?string $deletedBy = null;
-    public function setDeletedBy(?string $deletedBy): self
+    protected function setDeletedBy(?string $deletedBy): self
     {
         $this->deletedBy = $deletedBy;
         return $this;

256) /var/www/html/src/Kernel/Traits/DeletedTrait.php:22    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $this->deletedBy = $deletedBy;
         return $this;
     }
-    public function getDeletedBy(): ?string
+    protected function getDeletedBy(): ?string
     {
         return $this->deletedBy;
     }

257) /var/www/html/src/Kernel/Traits/DeletedTrait.php:27    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->deletedBy;
     }
-    public function setDeletedAt(?\DateTimeImmutable $deletedAt): self
+    protected function setDeletedAt(?\DateTimeImmutable $deletedAt): self
     {
         $this->deletedAt = $deletedAt;
         return $this;

258) /var/www/html/src/Kernel/Traits/DeletedTrait.php:34    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $this->deletedAt = $deletedAt;
         return $this;
     }
-    public function getDeletedAt(): ?\DateTimeImmutable
+    protected function getDeletedAt(): ?\DateTimeImmutable
     {
         return $this->deletedAt;
     }

259) /var/www/html/src/Kernel/Traits/DeletedTrait.php:39    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->deletedAt;
     }
-    public function isDeleted(): bool
+    protected function isDeleted(): bool
     {
         return null !== $this->deletedAt;
     }
 }

260) /var/www/html/src/Kernel/Traits/DeletedTrait.php:41    [M] NotIdentical

--- Original
+++ New
@@ @@
     }
     public function isDeleted(): bool
     {
-        return null !== $this->deletedAt;
+        return null === $this->deletedAt;
     }
 }

261) /var/www/html/src/Kernel/Traits/UpdatedTrait.php:17    [M] PublicVisibility

--- Original
+++ New
@@ @@
     private ?\DateTimeImmutable $updatedAt = null;
     #[ORM\Column(type: 'string', length: 191, nullable: true)]
     private ?string $updatedBy = null;
-    public function getUpdatedAt(): ?\DateTimeImmutable
+    protected function getUpdatedAt(): ?\DateTimeImmutable
     {
         return $this->updatedAt;
     }

262) /var/www/html/src/Kernel/Traits/UpdatedTrait.php:22    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->updatedAt;
     }
-    public function setUpdatedAt(?\DateTimeImmutable $updatedAt): self
+    protected function setUpdatedAt(?\DateTimeImmutable $updatedAt): self
     {
         $this->updatedAt = $updatedAt;
         return $this;

263) /var/www/html/src/Kernel/Traits/UpdatedTrait.php:29    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $this->updatedAt = $updatedAt;
         return $this;
     }
-    public function setUpdatedBy(?string $updatedBy): self
+    protected function setUpdatedBy(?string $updatedBy): self
     {
         $this->updatedBy = $updatedBy;
         return $this;

264) /var/www/html/src/Kernel/Traits/UpdatedTrait.php:36    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $this->updatedBy = $updatedBy;
         return $this;
     }
-    public function getUpdatedBy(): ?string
+    protected function getUpdatedBy(): ?string
     {
         return $this->updatedBy;
     }
 }
