186) /var/www/html/src/Account/Ui/Authentication/Login/LoginController.php:22    [M] LogicalAnd

--- Original
+++ New
@@ @@
         if ($user && false === $user->isVerified()) {
             $this->addFlash('warning', 'dashboard.authentication.login.verifyEmail');
         }
-        if ($user && $user->isAdmin() && $user->isVerified()) {
+        if (($user || $user->isAdmin()) && $user->isVerified()) {
             return $this->redirectToRoute(AccountAuthenticatorService::DASHBOARD_ROUTE);
         }
         // get the authentication error if there is one

187) /var/www/html/src/Account/Ui/Authentication/Login/LoginController.php:22    [M] LogicalAnd

--- Original
+++ New
@@ @@
         if ($user && false === $user->isVerified()) {
             $this->addFlash('warning', 'dashboard.authentication.login.verifyEmail');
         }
-        if ($user && $user->isAdmin() && $user->isVerified()) {
+        if ($user && $user->isAdmin() || $user->isVerified()) {
             return $this->redirectToRoute(AccountAuthenticatorService::DASHBOARD_ROUTE);
         }
         // get the authentication error if there is one

188) /var/www/html/src/Account/Ui/Authentication/Login/LoginController.php:22    [M] LogicalAndAllSubExprNegation

--- Original
+++ New
@@ @@
         if ($user && false === $user->isVerified()) {
             $this->addFlash('warning', 'dashboard.authentication.login.verifyEmail');
         }
-        if ($user && $user->isAdmin() && $user->isVerified()) {
+        if (!$user && !$user->isAdmin() && !$user->isVerified()) {
             return $this->redirectToRoute(AccountAuthenticatorService::DASHBOARD_ROUTE);
         }
         // get the authentication error if there is one

189) /var/www/html/src/Account/Ui/Authentication/Login/LoginController.php:22    [M] LogicalAndNegation

--- Original
+++ New
@@ @@
         if ($user && false === $user->isVerified()) {
             $this->addFlash('warning', 'dashboard.authentication.login.verifyEmail');
         }
-        if ($user && $user->isAdmin() && $user->isVerified()) {
+        if (!($user && $user->isAdmin() && $user->isVerified())) {
             return $this->redirectToRoute(AccountAuthenticatorService::DASHBOARD_ROUTE);
         }
         // get the authentication error if there is one

190) /var/www/html/src/Account/Ui/Authentication/Login/LoginController.php:22    [M] LogicalAndSingleSubExprNegation

--- Original
+++ New
@@ @@
         if ($user && false === $user->isVerified()) {
             $this->addFlash('warning', 'dashboard.authentication.login.verifyEmail');
         }
-        if ($user && $user->isAdmin() && $user->isVerified()) {
+        if (!$user && $user->isAdmin() && $user->isVerified()) {
             return $this->redirectToRoute(AccountAuthenticatorService::DASHBOARD_ROUTE);
         }
         // get the authentication error if there is one

191) /var/www/html/src/Account/Ui/Authentication/Login/LoginController.php:22    [M] LogicalAndSingleSubExprNegation

--- Original
+++ New
@@ @@
         if ($user && false === $user->isVerified()) {
             $this->addFlash('warning', 'dashboard.authentication.login.verifyEmail');
         }
-        if ($user && $user->isAdmin() && $user->isVerified()) {
+        if ($user && !$user->isAdmin() && $user->isVerified()) {
             return $this->redirectToRoute(AccountAuthenticatorService::DASHBOARD_ROUTE);
         }
         // get the authentication error if there is one

192) /var/www/html/src/Account/Ui/Authentication/Login/LoginController.php:22    [M] LogicalAndSingleSubExprNegation

--- Original
+++ New
@@ @@
         if ($user && false === $user->isVerified()) {
             $this->addFlash('warning', 'dashboard.authentication.login.verifyEmail');
         }
-        if ($user && $user->isAdmin() && $user->isVerified()) {
+        if ($user && $user->isAdmin() && !$user->isVerified()) {
             return $this->redirectToRoute(AccountAuthenticatorService::DASHBOARD_ROUTE);
         }
         // get the authentication error if there is one

193) /var/www/html/src/Account/Ui/Authentication/Login/LoginController.php:35    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         // last username entered by the user
         $lastUsername = $authenticationUtils->getLastUsername();
         $form = $this->createForm(LoginFormType::class);
-        return $this->render('dashboard/authentication/login.html.twig', ['last_username' => $lastUsername, 'error' => $error, 'loginForm' => $form->createView()]);
+        return $this->render('dashboard/authentication/login.html.twig', ['error' => $error, 'loginForm' => $form->createView()]);
     }
     #[Route(path: '/logout', name: 'app_logout')]
     public function logout(): never

194) /var/www/html/src/Account/Ui/Authentication/Login/LoginController.php:38    [M] ArrayItem

--- Original
+++ New
@@ @@
         // last username entered by the user
         $lastUsername = $authenticationUtils->getLastUsername();
         $form = $this->createForm(LoginFormType::class);
-        return $this->render('dashboard/authentication/login.html.twig', ['last_username' => $lastUsername, 'error' => $error, 'loginForm' => $form->createView()]);
+        return $this->render('dashboard/authentication/login.html.twig', ['last_username' => $lastUsername, 'error' => $error, 'loginForm' > $form->createView()]);
     }
     #[Route(path: '/logout', name: 'app_logout')]
     public function logout(): never

195) /var/www/html/src/Account/Ui/Authentication/Login/LoginController.php:43    [M] PublicVisibility

--- Original
+++ New
@@ @@
         return $this->render('dashboard/authentication/login.html.twig', ['last_username' => $lastUsername, 'error' => $error, 'loginForm' => $form->createView()]);
     }
     #[Route(path: '/logout', name: 'app_logout')]
-    public function logout(): never
+    protected function logout(): never
     {
         throw new \LogicException('This method can be blank - it will be intercepted by the logout key on your firewall.');
     }
 }

196) /var/www/html/src/Account/Ui/Authentication/Login/LoginController.php:46    [M] Throw_

--- Original
+++ New
@@ @@
     #[Route(path: '/logout', name: 'app_logout')]
     public function logout(): never
     {
-        throw new \LogicException('This method can be blank - it will be intercepted by the logout key on your firewall.');
+        new \LogicException('This method can be blank - it will be intercepted by the logout key on your firewall.');
     }
 }

197) /var/www/html/src/Account/Ui/Authentication/Registration/RegistrationController.php:22    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
     }
     #[Route('/dashboard/register', name: 'app_register')]
-    public function register(Request $request, Security $security): ?Response
+    protected function register(Request $request, Security $security): ?Response
     {
         $form = $this->createForm(RegistrationFormType::class);
         $form->handleRequest($request);

198) /var/www/html/src/Account/Ui/Authentication/Registration/RegistrationController.php:28    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public function register(Request $request, Security $security): ?Response
     {
         $form = $this->createForm(RegistrationFormType::class);
-        $form->handleRequest($request);
+        
         if ($form->isSubmitted() && $form->isValid()) {
             try {
                 $user = $this->userManager->createNewUser($form->get('email')->getData(), $form->get('password')->getData());

204) /var/www/html/src/Account/Ui/Authentication/Registration/RegistrationController.php:37    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             try {
                 $user = $this->userManager->createNewUser($form->get('email')->getData(), $form->get('password')->getData());
             } catch (\Throwable $e) {
-                $this->addFlash('error', $e->getMessage());
+                
                 return $this->redirectToRoute('app_register');
             }
             $this->addFlash('info', 'dashboard.authentication.register.verificationEmailSent');

205) /var/www/html/src/Account/Ui/Authentication/Registration/RegistrationController.php:41    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
                 $this->addFlash('error', $e->getMessage());
                 return $this->redirectToRoute('app_register');
             }
-            $this->addFlash('info', 'dashboard.authentication.register.verificationEmailSent');
+            
             return $security->login($user, AccountAuthenticator::class, 'main');
         }
         return $this->render('dashboard/authentication/register.html.twig', ['registrationForm' => $form]);

206) /var/www/html/src/Account/Ui/Authentication/Registration/RegistrationController.php:45    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
             $this->addFlash('info', 'dashboard.authentication.register.verificationEmailSent');
             return $security->login($user, AccountAuthenticator::class, 'main');
         }
-        return $this->render('dashboard/authentication/register.html.twig', ['registrationForm' => $form]);
+        return $this->render('dashboard/authentication/register.html.twig', []);
     }
     #[Route('/dashboard/register/confirm/{token}', name: 'app_register_confirm')]
     public function confirmRegistration(Request $request, Security $security): null|Response

207) /var/www/html/src/Account/Ui/Authentication/Registration/RegistrationController.php:50    [M] PublicVisibility

--- Original
+++ New
@@ @@
         return $this->render('dashboard/authentication/register.html.twig', ['registrationForm' => $form]);
     }
     #[Route('/dashboard/register/confirm/{token}', name: 'app_register_confirm')]
-    public function confirmRegistration(Request $request, Security $security): null|Response
+    protected function confirmRegistration(Request $request, Security $security): null|Response
     {
         try {
             $token = $request->get('token');

209) /var/www/html/src/Account/Ui/Authentication/ResetPassword/ResetPasswordController.php:22    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
     }
     #[Route('/dashboard/forgot-password', name: 'app_forgot_password')]
-    public function forgotPassword(Request $request): Response
+    protected function forgotPassword(Request $request): Response
     {
         $form = $this->createForm(ForgotPasswordFormType::class);
         $form->handleRequest($request);

210) /var/www/html/src/Account/Ui/Authentication/ResetPassword/ResetPasswordController.php:26    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public function forgotPassword(Request $request): Response
     {
         $form = $this->createForm(ForgotPasswordFormType::class);
-        $form->handleRequest($request);
+        
         if ($form->isSubmitted() && $form->isValid()) {
             try {
                 $email = $form->get('email')->getData();

216) /var/www/html/src/Account/Ui/Authentication/ResetPassword/ResetPasswordController.php:32    [M] Identical

--- Original
+++ New
@@ @@
         if ($form->isSubmitted() && $form->isValid()) {
             try {
                 $email = $form->get('email')->getData();
-                if (null === $email) {
+                if (null !== $email) {
                     throw new EmailRequiredException();
                 }
                 $this->resetPasswordService->sendResetPasswordEmail($email);

217) /var/www/html/src/Account/Ui/Authentication/ResetPassword/ResetPasswordController.php:33    [M] Throw_

--- Original
+++ New
@@ @@
             try {
                 $email = $form->get('email')->getData();
                 if (null === $email) {
-                    throw new EmailRequiredException();
+                    new EmailRequiredException();
                 }
                 $this->resetPasswordService->sendResetPasswordEmail($email);
                 $this->addFlash('success', $this->translator->trans('dashboard.authentication.resetPassword.email.sent'));

218) /var/www/html/src/Account/Ui/Authentication/ResetPassword/ResetPasswordController.php:36    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
                 if (null === $email) {
                     throw new EmailRequiredException();
                 }
-                $this->resetPasswordService->sendResetPasswordEmail($email);
+                
                 $this->addFlash('success', $this->translator->trans('dashboard.authentication.resetPassword.email.sent'));
                 $this->redirectToRoute('app_login');
             } catch (\Throwable $exception) {

219) /var/www/html/src/Account/Ui/Authentication/ResetPassword/ResetPasswordController.php:38    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
                     throw new EmailRequiredException();
                 }
                 $this->resetPasswordService->sendResetPasswordEmail($email);
-                $this->addFlash('success', $this->translator->trans('dashboard.authentication.resetPassword.email.sent'));
+                
                 $this->redirectToRoute('app_login');
             } catch (\Throwable $exception) {
                 $this->addFlash('error', $exception->getMessage());

220) /var/www/html/src/Account/Ui/Authentication/ResetPassword/ResetPasswordController.php:41    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
                 }
                 $this->resetPasswordService->sendResetPasswordEmail($email);
                 $this->addFlash('success', $this->translator->trans('dashboard.authentication.resetPassword.email.sent'));
-                $this->redirectToRoute('app_login');
+                
             } catch (\Throwable $exception) {
                 $this->addFlash('error', $exception->getMessage());
             }

221) /var/www/html/src/Account/Ui/Authentication/ResetPassword/ResetPasswordController.php:43    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
                 $this->addFlash('success', $this->translator->trans('dashboard.authentication.resetPassword.email.sent'));
                 $this->redirectToRoute('app_login');
             } catch (\Throwable $exception) {
-                $this->addFlash('error', $exception->getMessage());
+                
             }
         }
         return $this->render('dashboard/authentication/resetPassword/forgot-password.html.twig', ['forgotPasswordForm' => $form]);

222) /var/www/html/src/Account/Ui/Authentication/ResetPassword/ResetPasswordController.php:49    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
                 $this->addFlash('error', $exception->getMessage());
             }
         }
-        return $this->render('dashboard/authentication/resetPassword/forgot-password.html.twig', ['forgotPasswordForm' => $form]);
+        return $this->render('dashboard/authentication/resetPassword/forgot-password.html.twig', []);
     }
     #[Route('/dashboard/reset-password', name: 'app_reset_password')]
     public function resetPassword(Request $request): Response

223) /var/www/html/src/Account/Ui/Authentication/ResetPassword/ResetPasswordController.php:55    [M] PublicVisibility

--- Original
+++ New
@@ @@
         return $this->render('dashboard/authentication/resetPassword/forgot-password.html.twig', ['forgotPasswordForm' => $form]);
     }
     #[Route('/dashboard/reset-password', name: 'app_reset_password')]
-    public function resetPassword(Request $request): Response
+    protected function resetPassword(Request $request): Response
     {
         $form = $this->createForm(ResetPasswordFormType::class);
         $form->handleRequest($request);

224) /var/www/html/src/Account/Ui/Authentication/ResetPassword/ResetPasswordController.php:59    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public function resetPassword(Request $request): Response
     {
         $form = $this->createForm(ResetPasswordFormType::class);
-        $form->handleRequest($request);
+        
         if ($form->isSubmitted() && $form->isValid()) {
             try {
                 $token = $request->get('token');

230) /var/www/html/src/Account/Ui/Authentication/ResetPassword/ResetPasswordController.php:67    [M] Identical

--- Original
+++ New
@@ @@
                 $token = $request->get('token');
                 $email = $request->get('email');
                 $password = $form->get('password')->getData();
-                if (null === $password) {
+                if (null !== $password) {
                     throw new PasswordRequiredException();
                 }
                 $this->resetPasswordService->resetPassword($token, $email, $form->get('password')->getData());

231) /var/www/html/src/Account/Ui/Authentication/ResetPassword/ResetPasswordController.php:68    [M] Throw_

--- Original
+++ New
@@ @@
                 $email = $request->get('email');
                 $password = $form->get('password')->getData();
                 if (null === $password) {
-                    throw new PasswordRequiredException();
+                    new PasswordRequiredException();
                 }
                 $this->resetPasswordService->resetPassword($token, $email, $form->get('password')->getData());
                 $this->addFlash('success', $this->translator->trans('dashboard.authentication.resetPassword.success'));

232) /var/www/html/src/Account/Ui/Authentication/ResetPassword/ResetPasswordController.php:71    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
                 if (null === $password) {
                     throw new PasswordRequiredException();
                 }
-                $this->resetPasswordService->resetPassword($token, $email, $form->get('password')->getData());
+                
                 $this->addFlash('success', $this->translator->trans('dashboard.authentication.resetPassword.success'));
                 $this->redirectToRoute('app_login');
             } catch (\Throwable $exception) {

233) /var/www/html/src/Account/Ui/Authentication/ResetPassword/ResetPasswordController.php:73    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
                     throw new PasswordRequiredException();
                 }
                 $this->resetPasswordService->resetPassword($token, $email, $form->get('password')->getData());
-                $this->addFlash('success', $this->translator->trans('dashboard.authentication.resetPassword.success'));
+                
                 $this->redirectToRoute('app_login');
             } catch (\Throwable $exception) {
                 $this->addFlash('error', $exception->getMessage());

234) /var/www/html/src/Account/Ui/Authentication/ResetPassword/ResetPasswordController.php:76    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
                 }
                 $this->resetPasswordService->resetPassword($token, $email, $form->get('password')->getData());
                 $this->addFlash('success', $this->translator->trans('dashboard.authentication.resetPassword.success'));
-                $this->redirectToRoute('app_login');
+                
             } catch (\Throwable $exception) {
                 $this->addFlash('error', $exception->getMessage());
             }

236) /var/www/html/src/Account/Ui/Authentication/ResetPassword/ResetPasswordController.php:84    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
                 $this->addFlash('error', $exception->getMessage());
             }
         }
-        return $this->render('dashboard/authentication/resetPassword/reset-password.html.twig', ['resetPasswordForm' => $form]);
+        return $this->render('dashboard/authentication/resetPassword/reset-password.html.twig', []);
     }
 }

237) /var/www/html/src/Account/Ui/Authentication/Terms/TermsController.php:12    [M] PublicVisibility

--- Original
+++ New
@@ @@
 class TermsController extends AbstractBaseController
 {
     #[Route('/dashboard/terms', name: 'app_terms')]
-    public function showTerms(TranslatorInterface $translator): Response
+    protected function showTerms(TranslatorInterface $translator): Response
     {
         $locale = $translator->getLocale();
         return $this->render($this->getTemplate($locale));
