265) /var/www/html/src/Kernel/Ui/Form/Field/VichImageField.php:27    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return (new self())->setProperty($propertyName)->setLabel($label)->setFormType(VichImageType::class)->setCustomOption(self::OPTION_IMAGE_URI, null)->setCustomOption(self::OPTION_DOWNLOAD_URI, null);
     }
-    public function setImageUri(?string $imageUri): self
+    protected function setImageUri(?string $imageUri): self
     {
         $this->setCustomOption(self::OPTION_IMAGE_URI, $imageUri);
         return $this;

266) /var/www/html/src/Kernel/Ui/Form/Field/VichImageField.php:29    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     }
     public function setImageUri(?string $imageUri): self
     {
-        $this->setCustomOption(self::OPTION_IMAGE_URI, $imageUri);
+        
         return $this;
     }
     public function setDownloadUri(?string $downloadUri): self

267) /var/www/html/src/Kernel/Ui/Form/Field/VichImageField.php:34    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $this->setCustomOption(self::OPTION_IMAGE_URI, $imageUri);
         return $this;
     }
-    public function setDownloadUri(?string $downloadUri): self
+    protected function setDownloadUri(?string $downloadUri): self
     {
         $this->setCustomOption(self::OPTION_DOWNLOAD_URI, $downloadUri);
         return $this;

268) /var/www/html/src/Kernel/Ui/Form/Field/VichImageField.php:36    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     }
     public function setDownloadUri(?string $downloadUri): self
     {
-        $this->setCustomOption(self::OPTION_DOWNLOAD_URI, $downloadUri);
+        
         return $this;
     }
     public function setUploadedFileNamePattern(?string $patternOrCallable): self

269) /var/www/html/src/Kernel/Ui/Form/Field/VichImageField.php:41    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $this->setCustomOption(self::OPTION_DOWNLOAD_URI, $downloadUri);
         return $this;
     }
-    public function setUploadedFileNamePattern(?string $patternOrCallable): self
+    protected function setUploadedFileNamePattern(?string $patternOrCallable): self
     {
         $this->setCustomOption(self::OPTION_UPLOADED_FILE_NAME_PATTERN, $patternOrCallable);
         return $this;
     }
 }

270) /var/www/html/src/Kernel/Ui/Form/Field/VichImageField.php:43    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     }
     public function setUploadedFileNamePattern(?string $patternOrCallable): self
     {
-        $this->setCustomOption(self::OPTION_UPLOADED_FILE_NAME_PATTERN, $patternOrCallable);
+        
         return $this;
     }
 }

271) /var/www/html/src/Tournament/Domain/Tournament.php:125    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $this->source = $source;
         $this->link = $link;
     }
-    public function getId(): Uuid
+    protected function getId(): Uuid
     {
         return $this->id;
     }

272) /var/www/html/src/Tournament/Domain/Tournament.php:130    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->id;
     }
-    public function getName(): TournamentName
+    protected function getName(): TournamentName
     {
         return $this->name;
     }

273) /var/www/html/src/Tournament/Domain/Tournament.php:135    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->name;
     }
-    public function getLocation(): TournamentLocation
+    protected function getLocation(): TournamentLocation
     {
         return $this->location;
     }

274) /var/www/html/src/Tournament/Domain/Tournament.php:140    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->location;
     }
-    public function getProvince(): TournamentProvince
+    protected function getProvince(): TournamentProvince
     {
         return $this->province;
     }

275) /var/www/html/src/Tournament/Domain/Tournament.php:145    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->province;
     }
-    public function getStatus(): TournamentStatus
+    protected function getStatus(): TournamentStatus
     {
         return $this->status;
     }

276) /var/www/html/src/Tournament/Domain/Tournament.php:150    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->status;
     }
-    public function getType(): TournamentType
+    protected function getType(): TournamentType
     {
         return $this->type;
     }

277) /var/www/html/src/Tournament/Domain/Tournament.php:155    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->type;
     }
-    public function getPace(): TournamentPace
+    protected function getPace(): TournamentPace
     {
         return $this->pace;
     }

278) /var/www/html/src/Tournament/Domain/Tournament.php:160    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->pace;
     }
-    public function getStartDate(): \DateTimeImmutable
+    protected function getStartDate(): \DateTimeImmutable
     {
         return $this->startDate;
     }

279) /var/www/html/src/Tournament/Domain/Tournament.php:165    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->startDate;
     }
-    public function getEndDate(): ?\DateTimeImmutable
+    protected function getEndDate(): ?\DateTimeImmutable
     {
         return $this->endDate;
     }

280) /var/www/html/src/Tournament/Domain/Tournament.php:170    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->endDate;
     }
-    public function getSource(): TournamentSource
+    protected function getSource(): TournamentSource
     {
         return $this->source;
     }

281) /var/www/html/src/Tournament/Domain/Tournament.php:175    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->source;
     }
-    public function getLink(): ?TournamentLink
+    protected function getLink(): ?TournamentLink
     {
         return $this->link;
     }
 }

283) /var/www/html/src/Tournament/Domain/TournamentFactory.php:39    [M] Ternary

--- Original
+++ New
@@ @@
 {
     {
-        return new Tournament(Uuid::v4(), $name, $location, $province, $status, $type, $pace, $startDate, $endDate, $source ?: TournamentSource::fromChessMaster(), $link);
+        return new Tournament(Uuid::v4(), $name, $location, $province, $status, $type, $pace, $startDate, $endDate, $source ? TournamentSource::fromChessMaster() : $source, $link);
     }
 }

284) /var/www/html/src/Tournament/Domain/ValueObject/Pace/TournamentPace.php:21    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         $this->pace = $pace;
     }
-    public static function classicalAll(): self
+    protected static function classicalAll(): self
     {
         return new self(TournamentPaceEnum::CLASSICAL_ALL);
     }

285) /var/www/html/src/Tournament/Domain/ValueObject/Pace/TournamentPace.php:26    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return new self(TournamentPaceEnum::CLASSICAL_ALL);
     }
-    public static function classicalFide(): self
+    protected static function classicalFide(): self
     {
         return new self(TournamentPaceEnum::CLASSICAL_FIDE);
     }

286) /var/www/html/src/Tournament/Domain/ValueObject/Pace/TournamentPace.php:31    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return new self(TournamentPaceEnum::CLASSICAL_FIDE);
     }
-    public static function classicalPzszach(): self
+    protected static function classicalPzszach(): self
     {
         return new self(TournamentPaceEnum::CLASSICAL_PZSZACH);
     }

287) /var/www/html/src/Tournament/Domain/ValueObject/Pace/TournamentPace.php:36    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return new self(TournamentPaceEnum::CLASSICAL_PZSZACH);
     }
-    public static function blitz(): self
+    protected static function blitz(): self
     {
         return new self(TournamentPaceEnum::BLITZ);
     }

288) /var/www/html/src/Tournament/Domain/ValueObject/Pace/TournamentPace.php:41    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return new self(TournamentPaceEnum::BLITZ);
     }
-    public static function bullet(): self
+    protected static function bullet(): self
     {
         return new self(TournamentPaceEnum::BULLET);
     }

289) /var/www/html/src/Tournament/Domain/ValueObject/Pace/TournamentPace.php:46    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return new self(TournamentPaceEnum::BULLET);
     }
-    public static function all(): self
+    protected static function all(): self
     {
         return new self(TournamentPaceEnum::ALL);
     }

290) /var/www/html/src/Tournament/Domain/ValueObject/Pace/TournamentPace.php:51    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return new self(TournamentPaceEnum::ALL);
     }
-    public static function speed(): self
+    protected static function speed(): self
     {
         return new self(TournamentPaceEnum::SPEED);
     }

291) /var/www/html/src/Tournament/Domain/ValueObject/Pace/TournamentPace.php:56    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return new self(TournamentPaceEnum::SPEED);
     }
-    public function isClassicalAll(): bool
+    protected function isClassicalAll(): bool
     {
         return TournamentPaceEnum::CLASSICAL_ALL === $this->pace;
     }

292) /var/www/html/src/Tournament/Domain/ValueObject/Pace/TournamentPace.php:58    [M] Identical

--- Original
+++ New
@@ @@
     }
     public function isClassicalAll(): bool
     {
-        return TournamentPaceEnum::CLASSICAL_ALL === $this->pace;
+        return TournamentPaceEnum::CLASSICAL_ALL !== $this->pace;
     }
     public function isClassicalFide(): bool
     {

293) /var/www/html/src/Tournament/Domain/ValueObject/Pace/TournamentPace.php:61    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return TournamentPaceEnum::CLASSICAL_ALL === $this->pace;
     }
-    public function isClassicalFide(): bool
+    protected function isClassicalFide(): bool
     {
         return TournamentPaceEnum::CLASSICAL_FIDE === $this->pace;
     }

294) /var/www/html/src/Tournament/Domain/ValueObject/Pace/TournamentPace.php:63    [M] Identical

--- Original
+++ New
@@ @@
     }
     public function isClassicalFide(): bool
     {
-        return TournamentPaceEnum::CLASSICAL_FIDE === $this->pace;
+        return TournamentPaceEnum::CLASSICAL_FIDE !== $this->pace;
     }
     public function isClassicalPzszach(): bool
     {

295) /var/www/html/src/Tournament/Domain/ValueObject/Pace/TournamentPace.php:66    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return TournamentPaceEnum::CLASSICAL_FIDE === $this->pace;
     }
-    public function isClassicalPzszach(): bool
+    protected function isClassicalPzszach(): bool
     {
         return TournamentPaceEnum::CLASSICAL_PZSZACH === $this->pace;
     }

296) /var/www/html/src/Tournament/Domain/ValueObject/Pace/TournamentPace.php:68    [M] Identical

--- Original
+++ New
@@ @@
     }
     public function isClassicalPzszach(): bool
     {
-        return TournamentPaceEnum::CLASSICAL_PZSZACH === $this->pace;
+        return TournamentPaceEnum::CLASSICAL_PZSZACH !== $this->pace;
     }
     public function isBlitz(): bool
     {

297) /var/www/html/src/Tournament/Domain/ValueObject/Pace/TournamentPace.php:71    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return TournamentPaceEnum::CLASSICAL_PZSZACH === $this->pace;
     }
-    public function isBlitz(): bool
+    protected function isBlitz(): bool
     {
         return TournamentPaceEnum::BLITZ === $this->pace;
     }

298) /var/www/html/src/Tournament/Domain/ValueObject/Pace/TournamentPace.php:73    [M] Identical

--- Original
+++ New
@@ @@
     }
     public function isBlitz(): bool
     {
-        return TournamentPaceEnum::BLITZ === $this->pace;
+        return TournamentPaceEnum::BLITZ !== $this->pace;
     }
     public function isBullet(): bool
     {

299) /var/www/html/src/Tournament/Domain/ValueObject/Pace/TournamentPace.php:76    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return TournamentPaceEnum::BLITZ === $this->pace;
     }
-    public function isBullet(): bool
+    protected function isBullet(): bool
     {
         return TournamentPaceEnum::BULLET === $this->pace;
     }

300) /var/www/html/src/Tournament/Domain/ValueObject/Pace/TournamentPace.php:78    [M] Identical

--- Original
+++ New
@@ @@
     }
     public function isBullet(): bool
     {
-        return TournamentPaceEnum::BULLET === $this->pace;
+        return TournamentPaceEnum::BULLET !== $this->pace;
     }
     public function isAll(): bool
     {

301) /var/www/html/src/Tournament/Domain/ValueObject/Pace/TournamentPace.php:81    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return TournamentPaceEnum::BULLET === $this->pace;
     }
-    public function isAll(): bool
+    protected function isAll(): bool
     {
         return TournamentPaceEnum::ALL === $this->pace;
     }

302) /var/www/html/src/Tournament/Domain/ValueObject/Pace/TournamentPace.php:83    [M] Identical

--- Original
+++ New
@@ @@
     }
     public function isAll(): bool
     {
-        return TournamentPaceEnum::ALL === $this->pace;
+        return TournamentPaceEnum::ALL !== $this->pace;
     }
     public function isSpeed(): bool
     {

303) /var/www/html/src/Tournament/Domain/ValueObject/Pace/TournamentPace.php:86    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return TournamentPaceEnum::ALL === $this->pace;
     }
-    public function isSpeed(): bool
+    protected function isSpeed(): bool
     {
         return TournamentPaceEnum::SPEED === $this->pace;
     }
 }

304) /var/www/html/src/Tournament/Domain/ValueObject/Pace/TournamentPace.php:88    [M] Identical

--- Original
+++ New
@@ @@
     }
     public function isSpeed(): bool
     {
-        return TournamentPaceEnum::SPEED === $this->pace;
+        return TournamentPaceEnum::SPEED !== $this->pace;
     }
 }

305) /var/www/html/src/Tournament/Domain/ValueObject/Source/TournamentSource.php:21    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         $this->source = $source;
     }
-    public static function fromChessArbiter(): self
+    protected static function fromChessArbiter(): self
     {
         return new self(TournamentSourceEnum::CHESS_ARBITER);
     }

306) /var/www/html/src/Tournament/Domain/ValueObject/Source/TournamentSource.php:26    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return new self(TournamentSourceEnum::CHESS_ARBITER);
     }
-    public static function fromChessMaster(): self
+    protected static function fromChessMaster(): self
     {
         return new self(TournamentSourceEnum::CHESS_MASTER);
     }

307) /var/www/html/src/Tournament/Domain/ValueObject/Source/TournamentSource.php:31    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return new self(TournamentSourceEnum::CHESS_MASTER);
     }
-    public function isFromChessArbiter(): bool
+    protected function isFromChessArbiter(): bool
     {
         return TournamentSourceEnum::CHESS_ARBITER === $this->source;
     }

308) /var/www/html/src/Tournament/Domain/ValueObject/Source/TournamentSource.php:33    [M] Identical

--- Original
+++ New
@@ @@
     }
     public function isFromChessArbiter(): bool
     {
-        return TournamentSourceEnum::CHESS_ARBITER === $this->source;
+        return TournamentSourceEnum::CHESS_ARBITER !== $this->source;
     }
     public function isFromChessMaster(): bool
     {

309) /var/www/html/src/Tournament/Domain/ValueObject/Source/TournamentSource.php:36    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return TournamentSourceEnum::CHESS_ARBITER === $this->source;
     }
-    public function isFromChessMaster(): bool
+    protected function isFromChessMaster(): bool
     {
         return TournamentSourceEnum::CHESS_MASTER === $this->source;
     }
 }

310) /var/www/html/src/Tournament/Domain/ValueObject/Source/TournamentSource.php:38    [M] Identical

--- Original
+++ New
@@ @@
     }
     public function isFromChessMaster(): bool
     {
-        return TournamentSourceEnum::CHESS_MASTER === $this->source;
+        return TournamentSourceEnum::CHESS_MASTER !== $this->source;
     }
 }

311) /var/www/html/src/Tournament/Domain/ValueObject/Status/TournamentStatus.php:21    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         $this->status = $status;
     }
-    public static function active(): self
+    protected static function active(): self
     {
         return new self(TournamentStatusEnum::ACTIVE);
     }

312) /var/www/html/src/Tournament/Domain/ValueObject/Status/TournamentStatus.php:26    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return new self(TournamentStatusEnum::ACTIVE);
     }
-    public static function finished(): self
+    protected static function finished(): self
     {
         return new self(TournamentStatusEnum::FINISHED);
     }

313) /var/www/html/src/Tournament/Domain/ValueObject/Status/TournamentStatus.php:31    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return new self(TournamentStatusEnum::FINISHED);
     }
-    public static function pending(): self
+    protected static function pending(): self
     {
         return new self(TournamentStatusEnum::PENDING);
     }

315) /var/www/html/src/Tournament/Domain/ValueObject/Status/TournamentStatus.php:38    [M] Identical

--- Original
+++ New
@@ @@
     }
     public function isActive(): bool
     {
-        return TournamentStatusEnum::ACTIVE === $this->status;
+        return TournamentStatusEnum::ACTIVE !== $this->status;
     }
     public function isFinished(): bool
     {

316) /var/www/html/src/Tournament/Domain/ValueObject/Status/TournamentStatus.php:41    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return TournamentStatusEnum::ACTIVE === $this->status;
     }
-    public function isFinished(): bool
+    protected function isFinished(): bool
     {
         return TournamentStatusEnum::FINISHED === $this->status;
     }

317) /var/www/html/src/Tournament/Domain/ValueObject/Status/TournamentStatus.php:43    [M] Identical

--- Original
+++ New
@@ @@
     }
     public function isFinished(): bool
     {
-        return TournamentStatusEnum::FINISHED === $this->status;
+        return TournamentStatusEnum::FINISHED !== $this->status;
     }
     public function isPending(): bool
     {

318) /var/www/html/src/Tournament/Domain/ValueObject/Status/TournamentStatus.php:46    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return TournamentStatusEnum::FINISHED === $this->status;
     }
-    public function isPending(): bool
+    protected function isPending(): bool
     {
         return TournamentStatusEnum::PENDING === $this->status;
     }
 }

319) /var/www/html/src/Tournament/Domain/ValueObject/Status/TournamentStatus.php:48    [M] Identical

--- Original
+++ New
@@ @@
     }
     public function isPending(): bool
     {
-        return TournamentStatusEnum::PENDING === $this->status;
+        return TournamentStatusEnum::PENDING !== $this->status;
     }
 }

320) /var/www/html/src/Tournament/Domain/ValueObject/Type/TournamentType.php:21    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         $this->type = $type;
     }
-    public static function individual(): self
+    protected static function individual(): self
     {
         return new self(TournamentTypeEnum::INDIVIDUAL);
     }

321) /var/www/html/src/Tournament/Domain/ValueObject/Type/TournamentType.php:26    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return new self(TournamentTypeEnum::INDIVIDUAL);
     }
-    public static function team(): self
+    protected static function team(): self
     {
         return new self(TournamentTypeEnum::TEAM);
     }

322) /var/www/html/src/Tournament/Domain/ValueObject/Type/TournamentType.php:31    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return new self(TournamentTypeEnum::TEAM);
     }
-    public static function provincialChampionship(): self
+    protected static function provincialChampionship(): self
     {
         return new self(TournamentTypeEnum::PROVINCIAL_CHAMPIONSHIP);
     }

323) /var/www/html/src/Tournament/Domain/ValueObject/Type/TournamentType.php:36    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return new self(TournamentTypeEnum::PROVINCIAL_CHAMPIONSHIP);
     }
-    public static function polishChampionship(): self
+    protected static function polishChampionship(): self
     {
         return new self(TournamentTypeEnum::POLISH_CHAMPIONSHIP);
     }

324) /var/www/html/src/Tournament/Domain/ValueObject/Type/TournamentType.php:41    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return new self(TournamentTypeEnum::POLISH_CHAMPIONSHIP);
     }
-    public function isIndividual(): bool
+    protected function isIndividual(): bool
     {
         return TournamentTypeEnum::INDIVIDUAL === $this->type;
     }

325) /var/www/html/src/Tournament/Domain/ValueObject/Type/TournamentType.php:43    [M] Identical

--- Original
+++ New
@@ @@
     }
     public function isIndividual(): bool
     {
-        return TournamentTypeEnum::INDIVIDUAL === $this->type;
+        return TournamentTypeEnum::INDIVIDUAL !== $this->type;
     }
     public function isTeam(): bool
     {

326) /var/www/html/src/Tournament/Domain/ValueObject/Type/TournamentType.php:46    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return TournamentTypeEnum::INDIVIDUAL === $this->type;
     }
-    public function isTeam(): bool
+    protected function isTeam(): bool
     {
         return TournamentTypeEnum::TEAM === $this->type;
     }

327) /var/www/html/src/Tournament/Domain/ValueObject/Type/TournamentType.php:48    [M] Identical

--- Original
+++ New
@@ @@
     }
     public function isTeam(): bool
     {
-        return TournamentTypeEnum::TEAM === $this->type;
+        return TournamentTypeEnum::TEAM !== $this->type;
     }
     public function isProvincialChampionship(): bool
     {

328) /var/www/html/src/Tournament/Domain/ValueObject/Type/TournamentType.php:51    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return TournamentTypeEnum::TEAM === $this->type;
     }
-    public function isProvincialChampionship(): bool
+    protected function isProvincialChampionship(): bool
     {
         return TournamentTypeEnum::PROVINCIAL_CHAMPIONSHIP === $this->type;
     }

329) /var/www/html/src/Tournament/Domain/ValueObject/Type/TournamentType.php:53    [M] Identical

--- Original
+++ New
@@ @@
     }
     public function isProvincialChampionship(): bool
     {
-        return TournamentTypeEnum::PROVINCIAL_CHAMPIONSHIP === $this->type;
+        return TournamentTypeEnum::PROVINCIAL_CHAMPIONSHIP !== $this->type;
     }
     public function isPolishChampionship(): bool
     {

330) /var/www/html/src/Tournament/Domain/ValueObject/Type/TournamentType.php:56    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return TournamentTypeEnum::PROVINCIAL_CHAMPIONSHIP === $this->type;
     }
-    public function isPolishChampionship(): bool
+    protected function isPolishChampionship(): bool
     {
         return TournamentTypeEnum::POLISH_CHAMPIONSHIP === $this->type;
     }
 }

331) /var/www/html/src/Tournament/Domain/ValueObject/Type/TournamentType.php:58    [M] Identical

--- Original
+++ New
@@ @@
     }
     public function isPolishChampionship(): bool
     {
-        return TournamentTypeEnum::POLISH_CHAMPIONSHIP === $this->type;
+        return TournamentTypeEnum::POLISH_CHAMPIONSHIP !== $this->type;
     }
 }

332) /var/www/html/src/Tournament/Infrastructure/Rest/TournamentRepository.php:22    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
 {
     public function __construct(ManagerRegistry $registry)
     {
-        parent::__construct($registry, Tournament::class);
+        
     }
 }

333) /var/www/html/src/Tournament/Ui/TournamentInput.php:34    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $this->endDate = $endDate;
         $this->source = $source;
     }
-    public function getName(): string
+    protected function getName(): string
     {
         return $this->name;
     }

334) /var/www/html/src/Tournament/Ui/TournamentInput.php:39    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->name;
     }
-    public function getType(): string
+    protected function getType(): string
     {
         return $this->type;
     }

335) /var/www/html/src/Tournament/Ui/TournamentInput.php:44    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->type;
     }
-    public function getPace(): string
+    protected function getPace(): string
     {
         return $this->pace;
     }

336) /var/www/html/src/Tournament/Ui/TournamentInput.php:49    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->pace;
     }
-    public function getStatus(): string
+    protected function getStatus(): string
     {
         return $this->status;
     }

337) /var/www/html/src/Tournament/Ui/TournamentInput.php:54    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->status;
     }
-    public function getStartDate(): string
+    protected function getStartDate(): string
     {
         return $this->startDate;
     }

338) /var/www/html/src/Tournament/Ui/TournamentInput.php:59    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->startDate;
     }
-    public function getEndDate(): string
+    protected function getEndDate(): string
     {
         return $this->endDate;
     }

339) /var/www/html/src/Tournament/Ui/TournamentInput.php:64    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->endDate;
     }
-    public function getSource(): string
+    protected function getSource(): string
     {
         return $this->source;
     }
 }
